ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FREQUENCY_CHANNEL_ORACLE</name>
      <description>Frequency-memory, hardware channel-switch, NRX and channel-bandwidth
        registers recovered from complete finite ROM/blob bodies. Names retain
        UNKNOWN where the instructions prove a field but not its electrical
        meaning. One physical word has one identity even when a bit has
        different mode-dependent roles.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FREQUENCY_CONTROL</name>
          <description>Shared frequency module control word. Bit 18 is both the high bit
            of an eleven-bit command-memory address and the reset/release bit
            pulsed by phy_freq_module_resetn.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL_INDEX</name>
              <description>Complete phy_freq_chan_en_sw replaces the low byte with the caller's frequency-table index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMORY_ADDRESS_LOW_UNKNOWN</name>
              <description>Low ten bits of the eleven-bit address selected by phy_freq_i2c_mem_write.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMORY_ADDRESS_HIGH_OR_MODULE_RESET_UNKNOWN</name>
              <description>High address bit during frequency-memory writes; independently cleared then set by complete phy_freq_module_resetn.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHANNEL_SWITCH_PULSE</name>
              <description>Complete phy_freq_chan_en_sw sets bit 19, delays one microsecond, then clears it.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MEMORY_WRITE_PULSE</name>
              <description>Complete phy_freq_i2c_mem_write sets then clears bit 20 after publishing data.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REGISTER_MODE_UNKNOWN</name>
              <description>Complete phy_freq_reg_init replaces bits 29:22 with its two input nibbles; the electrical encoding is unknown.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODULE_ENABLE_UNKNOWN</name>
              <description>Complete phy_freq_reg_init sets bit 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HARDWARE_FREQUENCY_DISABLE</name>
              <description>Complete phy_dis_hw_set_freq sets bit 31 before its two-microsecond delay; complete phy_en_hw_set_freq clears it.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_MEMORY_READ_CONTROL</name>
          <description>Complete phy_read_rf_freq_mem pulses bit 16 after publishing the address and read mode; all other bits remain preserved and unnamed.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ_PULSE</name>
              <description>Set and then cleared by complete phy_read_rf_freq_mem for one synchronous frequency-memory read transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_PARAMETER_0_OPAQUE</name>
          <description>Complete phy_freq_reg_init writes the full constant 0x19800249; no constituent electrical fields are public.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPAQUE_VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_PARAMETER_1_STATUS</name>
          <description>Complete phy_freq_reg_init writes 0x25824e58; phy_bb_init replaces the low baseband-mode field, and the open channel state machine samples bit 8 for the evidenced ready edge.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASEBAND_MODE_UNKNOWN</name>
              <description>Complete phy_bb_init writes encoding two before calibration and zero after the initial channel setup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT_LOW_UNKNOWN</name>
              <description>Bits 7:2 of the complete initialization image.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FREQUENCY_READY</name>
              <description>The complete channel parent samples bit 8 after the frequency-switch delay and branches on its asserted edge.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INIT_HIGH_UNKNOWN</name>
              <description>Bits 31:9 of the complete initialization image.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>23</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8388607</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_MEMORY_DATA</name>
          <description>Data/mode word published by complete phy_freq_i2c_mem_write.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_NUMBER_CONTROL</name>
          <description>First two five-bit PHY-I2C number addresses packed by complete phy_freq_i2c_num_addr.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEMORY_READ_MODE</name>
              <description>Complete phy_read_rf_freq_mem replaces only the low two bits with its read-mode argument.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_0_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_1_UNKNOWN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>I2C_NUMBER_WORD%s</name>
          <description>Six consecutive five-bit PHY-I2C number addresses packed by complete phy_freq_num_get_data; unused slots are zero.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NUMBER_ADDRESS_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_1_UNKNOWN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_2_UNKNOWN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_3_UNKNOWN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_4_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NUMBER_ADDRESS_5_UNKNOWN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <description>High two bits of the complete caller-prepared word; the recovered producer normally leaves them zero.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_MEMORY_READ_RESULT</name>
          <description>Complete phy_read_rf_freq_mem returns this full word after the read pulse; individual result fields are interpreted by the caller.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete phy_read_rf_freq_mem returns this full read-only result to its caller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FBW_BT_FILTER_CONTROL</name>
          <description>Shared filter-bandwidth and Bluetooth-filter word independently updated by complete phy_wifi_fbw_sel and phy_bt_filter_reg.</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FBW_CLEAR_LOW_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBW_SELECT_MID_UNKNOWN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FBW_CLEAR_HIGH_UNKNOWN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBW_SELECT_HIGH_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BT_FILTER_LOW_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BT_FILTER_MODE_UNKNOWN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BT_FILTER_ENABLE_UNKNOWN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_TX_OFFSET_CONTROL</name>
          <description>Canonical multifunction PHY/MAC word. Complete phy_mac_tx_chan_offset and phy_bb_cbw_chan_cfg update the low channel-offset field; complete hal_set_tx_min_pwr updates bits 9:4 and the HE init parent independently sets bit 17.</description>
          <addressOffset>0x4400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL_OFFSET_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINIMUM_POWER_LOW</name>
              <description>Low four bits of the signed six-bit minimum-power value. Complete hal_set_tx_min_pwr(-11) writes five. Complete phy_mac_tx_chan_offset and phy_bb_cbw_chan_cfg preserve this field when updating the adjacent channel offset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINIMUM_POWER_HIGH</name>
              <description>High two bits of the signed six-bit minimum-power value. Complete hal_set_tx_min_pwr(-11) writes three.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HE_PARENT_ENABLE_UNKNOWN</name>
              <description>The complete HE init parent sets bit 17 through a separate fresh-read RMW.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NRX_FREQUENCY_CONTROL</name>
          <description>NRX initialization and frequency quotient word. Complete phy_nrx_freq_set samples and preserves the high byte and writes a twenty-four-bit quotient. Initialization writes the same complete low twenty-four-bit region with its own image.</description>
          <addressOffset>0x7848</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FREQUENCY_QUOTIENT_OR_INIT_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHIFT_LOW_OR_INIT_HIGH_UNKNOWN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHIFT_HIGH_UNKNOWN</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_CBW_CONTROL_0</name>
          <description>Complete phy_bb_cbw_chan_cfg replaces the low two-bit CBW-derived field.</description>
          <addressOffset>0x7CE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBW_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_CBW_CONTROL_1</name>
          <description>Complete phy_bb_cbw_chan_cfg performs two fresh-read CBW-derived replacements; complete phy_vht_support independently replaces bit five.</description>
          <addressOffset>0x7CE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBW_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CBW_HIGH_UNKNOWN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VHT_SUPPORT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
