ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_PBUS</name>
      <description>PBus command, mode, status/clock/force and packed result windows recovered
        from complete rev0 ROM bodies and their address/shift jump tables.
        The blob debug printer independently names selector/path groups:
        RFRX is selector 0 paths 1/2; BB is selector 1 paths 1/2; DCO is
        selectors 2/3 paths 1/2; RFTX is selector 4 paths 1/2 and selector 5
        path 1.</description>
      <baseAddress>0x20100880</baseAddress>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>phy_pbus_force_test command word; phy_pbus_force_mode also uses bit
            0 as the debug/work selector. The complete force-test body at
            0x2f824228 composes selector, test value and path first, then masks
            the combined image with 0x0001fffc. It does not independently
            narrow the signed halfword values supplied by
            phy_pbus_rx_dco_cal at 0x2f828f44, so their retained high bits can
            contribute to the physical PATH field.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEBUG_MODE_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANSACTION_START</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELECTOR</name>
              <description>Debug group selector: 0 RFRX, 1 BB, 2/3 DCO, 4/5 RFTX for the evidenced paths. Treat other selector/path combinations as undocumented.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TEST_VALUE</name>
              <description>Physical nine-bit value field. The ROM publication expression
                accepts a wider signed halfword before the combined command
                mask; use the PAC ROM encoder when reproducing that behavior.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>PATH</name>
              <description>Physical two-bit path field. High retained bits of a wide
                test-value argument are ORed into this field by the complete
                ROM command encoder. The debug printer exercises paths 1 and
                2 for RFRX, BB, DCO and selector-4 RFTX, and path 1 for
                selector-5 RFTX.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>PBus debug/work mode selector used by complete phy_pbus_force_mode.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WORK_MODE_ENABLE</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_CLOCK_FORCE</name>
          <description>One physical multifunction word independently used for TX/RX forcing, RX/TX clock pairs and PBus busy status.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_TXRX_MODE_UNKNOWN</name>
              <description>phy_force_txrx_off replaces bits 11:8 with one of four evidenced encodings; the individual bit meanings remain unknown.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>ENABLE_INITIAL_PHASE</name>
                  <description>First force-TX/RX enable write in complete phy_force_txrx_off.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_FINAL_PHASE</name>
                  <description>Second force-TX/RX enable write in complete phy_force_txrx_off.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_INITIAL_PHASE</name>
                  <description>First force-TX/RX disable write in complete phy_force_txrx_off.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FINAL_PHASE</name>
                  <description>Second force-TX/RX disable write in complete phy_force_txrx_off.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CLOCK_LOW_OR_RXIQ_STATUS_FIRST_UNKNOWN</name>
              <description>phy_set_rxclk_en writes this bit with its neighbor as a pair; complete phy_rxiq_cal_init independently sets it first at root entry. The shared electrical identity remains unknown.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_CLOCK_HIGH_OR_RXIQ_STATUS_SECOND_UNKNOWN</name>
              <description>phy_set_rxclk_en writes this bit with its neighbor as a pair; complete phy_rxiq_cal_init independently sets it at root entry and clears it during the successful cleanup suffix. The shared electrical identity remains unknown.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_CLOCK_ENABLE_PAIR</name>
              <description>phy_set_txclk_en writes both bits as a pair; individual clock identities are unknown.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable both recovered TX clock bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable both recovered TX clock bits.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_RESULT_0</name>
          <description>Shared PBus/FE word. Selector 1 reads result window 0 for non-path-1 operations, including RX-DCO, and window 1 for path 1. Complete phy_fe_reg_init independently sets bit 20 through a fresh-read RMW.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESULT_WINDOW_0_RX_DCO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT_WINDOW_1_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FE_INIT_ENABLE_UNKNOWN</name>
              <description>First complete phy_fe_reg_init RMW sets bit 20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_RESULT_1</name>
          <description>Selector 2 path 1 reads window 0; other bits are not presently evidenced.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT_WINDOW_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_RESULT_2</name>
          <description>Selector 3 reads windows 0/1; selector 2 non-path-1 reads window 2.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT_WINDOW_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_1_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_2_UNKNOWN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_RESULT_3</name>
          <description>Selector 4 path 1 reads window 0; selector 0 non-path-one reads window 1 and path one reads window 2.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT_WINDOW_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_1_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_2_UNKNOWN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_RESULT_4</name>
          <description>Selectors above five fall back to window 0, selector 5 reads window 1, and selector 4 non-path-one reads window 2.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT_WINDOW_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_1_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESULT_WINDOW_2_UNKNOWN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
