ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_I2C_COMMAND_RAM</name>
      <description>Official S31
        reg_base.h names this aperture DR_REG_I2C_ANA_MST_MEM_BASE. The
        complete blob establishes its forty-five-entry command layout and the
        population order in phy_i2c_master_cmd_mem_init. Complete
        phy_i2c_check independently names ten logical banks, their block IDs,
        selected host and finite register-index ranges.</description>
      <baseAddress>0x2010FC00</baseAddress>
      <registers>
        <register>
          <dim>45</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-44</dimIndex>
          <name>COMMAND_MEMORY%s</name>
          <description>One PHY-I2C master command-memory entry; the public header proves the containing memory aperture while the complete blob proves this word layout.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>Logical PHY-I2C block ID. The bank host and valid half-open register-index ranges are: SAR1 host 0 [0,7), ULP host 1 [0,11), RFPLL host 1 [0,22), RFPLL_SDM host 1 [0,7), BBPLL host 0 [0,11), BBTOP host 1 [0,57), PERIF host 0 [0,13), BIAS host 1 [0,4), TXRF host 1 [1,22), DIG_REG host 0 [0,15).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAR1</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFPLL</name>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFPLL_SDM</name>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBPLL</name>
                  <value>102</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBTOP</name>
                  <value>103</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIF</name>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS</name>
                  <value>106</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXRF</name>
                  <value>107</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_REG</name>
                  <value>109</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGISTER</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATA</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_AGC_ORACLE</name>
      <description>OPAQUE PHY AGC,
        PBus-pulse, antenna, RX-compensation, DC-memory, post-initialization
        and 11b-control registers recovered from complete, finite rev0
        ROM/blob bodies. One physical register has one identity even when
        independent bodies prove different fields. Names describe their
        proven operation role, not an unevidenced electrical identity.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>AGC_PARAMETER_CONTROL</name>
          <description>Complete phy_agc_reg_init performs two fresh-read parameter-derived field replacements.</description>
          <addressOffset>0x8BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARAMETER_121_UNKNOWN</name>
              <description>First update writes parameter byte 0x121 into bits 11:4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PARAMETER_120_OFFSET_UNKNOWN</name>
              <description>Second update writes the low eight bits of parameter byte 0x120 plus 0x50 into bits 19:12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_SHARED_CONTROL</name>
          <description>Shared word updated by complete phy_agc_reg_init, phy_enable_agc, phy_pbus_force_mode, phy_force_rx_gain, phy_set_rx_comp_new, and the final limit tail of phy_set_rx_gain_table.</description>
          <addressOffset>0x702C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_COMPENSATION_LOW_UNKNOWN</name>
              <description>Complete phy_set_rx_comp_new writes 0xed into bits 7:0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_GAIN_INDEX_UNKNOWN</name>
              <description>Bits 14:8 receive parameter byte 0x121 during AGC initialization and the final Wi-Fi RX gain index after table publication.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PULSE_UNKNOWN</name>
              <description>Bit 23 is pulsed by complete phy_enable_agc and by the delayed tail of phy_pbus_force_mode; complete phy_force_rx_gain replaces it with the caller low bit.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_HIGH_UNKNOWN</name>
              <description>Complete phy_agc_reg_init and the delayed phy_pbus_force_mode tail write 0x32 into bits 31:24 before pulsing bit 23; complete phy_force_rx_gain retains its second argument to this byte without rejecting any representable image.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_ANTENNA_CONTROL</name>
          <description>Shared word updated independently by complete AGC enable/disable, antenna initialization and frequency-band selection bodies.</description>
          <addressOffset>0x7030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FREQUENCY_BAND_INVERSE</name>
              <description>Complete phy_freq_band_reg_set writes the inverse of the caller low bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANTENNA_INIT_UNKNOWN</name>
              <description>Complete phy_ant_init writes 0x34 into bits 17:11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AGC_DISABLE_UNKNOWN</name>
              <description>Instruction-exact AGC disable/enable gate.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_DUMP_FORCE_CONTROL</name>
          <description>Complete phy_csidump_force_lltf_cfg replaces bit fifteen from the caller low bit.</description>
          <addressOffset>0x70A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_LLTF</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_MEMORY_CONTROL</name>
          <description>Complete phy_dc_mem_clr sets then clears bit 20 using a fresh read before each write.</description>
          <addressOffset>0x703C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLEAR_PULSE_UNKNOWN</name>
              <description>Instruction-exact set/clear pulse; the vendor symbol qualifies the operation while the electrical effect remains unknown.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_PATH_CONTROL_0</name>
          <description>Complete phy_bb_agc_reg_update writes the full word; complete phy_rx_11b_opt later replaces two six-bit fields.</description>
          <addressOffset>0x7044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_LOW_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt replaces bits 13:8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_11B_HIGH_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt replaces bits 21:16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_7048_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0xff7da4f3.</description>
          <addressOffset>0x7048</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_SATURATION_CONTROL</name>
          <description>Shared word updated by complete phy_agc_reg_init, both phy_rfrx_sat_rst branches, and phy_reg_update_new.</description>
          <addressOffset>0x705C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>Bits 18:0 receive 0xbb8 during AGC initialization and 0x400 or 0x800 in the two RF RX saturation phases.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>524287</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_19_UNKNOWN</name>
              <description>One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_24_UNKNOWN</name>
              <description>One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POST_INIT_SET_UNKNOWN</name>
              <description>Complete phy_reg_update_new sets bit 26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_28_UNKNOWN</name>
              <description>One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_HIGH_UNKNOWN</name>
              <description>Bits 31:30 are the adjacent high pair in the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SATURATION_GAIN_LOW</name>
          <description>Complete rev0 ROM phy_wifi_agc_sat_gain writes its argument here first.</description>
          <addressOffset>0x7064</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPAQUE_VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RX_SATURATION_CONFIG</name>
          <description>Complete phy_rfrx_sat_rst writes the full value 0x00000404 before either branch.</description>
          <addressOffset>0x7068</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_GAIN_LIMIT_LOW</name>
          <description>Complete phy_agc_reg_init replaces one seven-bit parameter-derived field.</description>
          <addressOffset>0x7094</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARAMETER_MINUS_ONE_UNKNOWN</name>
              <description>Bits 8:2 receive the low seven bits of parameter byte 0x121 minus one.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_COMPENSATION_HIGH_CONTROL</name>
          <description>Complete phy_set_rx_comp_new performs its second fresh-read update here.</description>
          <addressOffset>0x70A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_COMPENSATION_HIGH_UNKNOWN</name>
              <description>Complete phy_set_rx_comp_new writes 0xed into bits 31:24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_WINDOW_CONTROL</name>
          <description>Complete phy_bb_agc_reg_update writes the full word; phy_rx_11b_opt and phy_reg_update_new replace the same low nine-bit field with independently evidenced values.</description>
          <addressOffset>0x7104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINDOW_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt writes 0x1c8 and complete phy_reg_update_new writes 0x1c0 into bits 8:0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SATURATION_GAIN_HIGH</name>
          <description>Complete rev0 ROM phy_wifi_agc_sat_gain writes its argument here second.</description>
          <addressOffset>0x7114</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPAQUE_VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_CONTROL_0</name>
          <description>First fresh-read update of complete phy_ant_init clears two independently evidenced field groups; complete phy_ant_dft_cfg replaces bit 11 with its caller low bit.</description>
          <addressOffset>0x711C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_CLEAR_UNKNOWN</name>
              <description>Complete phy_ant_init clears bits 10:0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ANTENNA_DIVERSITY_ENABLE_UNKNOWN</name>
              <description>Complete phy_ant_dft_cfg writes zero to disable antenna diversity and one to enable it.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>AntennaDiversityEnable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable the recovered antenna-diversity path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable the recovered antenna-diversity path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_12_CLEAR_UNKNOWN</name>
              <description>Complete phy_ant_init independently clears bit 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_CONTROL_2</name>
          <description>Third fresh-read update of complete phy_ant_init writes the same value into two separated bytes.</description>
          <addressOffset>0x7120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>Complete phy_ant_init writes 0x1e into bits 15:8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <description>Complete phy_ant_init writes 0x1e into bits 31:24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_PATH_CONTROL_1</name>
          <description>Complete phy_bb_agc_reg_update writes the full word; complete phy_rx_11b_opt later replaces two fields.</description>
          <addressOffset>0x7124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_LOW_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt replaces bits 3:0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_11B_HIGH_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt replaces bits 15:10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
