ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>AGC_INIT_HIGH_CONTROL</name>
          <description>Canonical multifunction word. Complete phy_agc_reg_init replaces the high byte with 0xd2; complete hal_init_bf later performs one volatile full-word synchronization/status read whose value is unused.</description>
          <addressOffset>0x7128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_HIGH_UNKNOWN</name>
              <description>Instruction-exact 0xd2 value in bits 31:24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_GAIN_LIMIT_CONTROL</name>
          <description>Shared seven-bit gain limit written by phy_agc_reg_init and the final phy_set_rx_gain_table tail.</description>
          <addressOffset>0x713C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_GAIN_LIMIT_UNKNOWN</name>
              <description>Bits 24:18 receive parameter byte 0x121 minus one during initialization and the final Wi-Fi index capped at 0x4c after table publication.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_78A4_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x0001721f.</description>
          <addressOffset>0x78A4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>POST_INIT_RX_CONTROL</name>
          <description>Complete phy_reg_update_new performs two fresh-read field replacements in this order.</description>
          <addressOffset>0x78C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>First fresh-read update replaces bits 6:0 with 0x17.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <description>Second fresh-read update replaces bits 13:7 with 0x17.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FTM_CONTROL</name>
          <description>Complete phy_set_ftm_en replaces bit zero with its one-bit argument.</description>
          <addressOffset>0x7D4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>One-bit FTM enable argument.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_MODE_CONTROL</name>
          <description>Complete phy_bb_agc_reg_update clears bit 26; complete phy_rx_11b_opt replaces bits 15:12.</description>
          <addressOffset>0x8004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_MODE_UNKNOWN</name>
              <description>Complete phy_rx_11b_opt replaces bits 15:12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BB_AGC_UPDATE_CLEAR_UNKNOWN</name>
              <description>Complete phy_bb_agc_reg_update clears bit 26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_8010_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x000852a1.</description>
          <addressOffset>0x8010</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8018_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x00600030.</description>
          <addressOffset>0x8018</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_801C_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x010000a0.</description>
          <addressOffset>0x801C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8020_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x00000180.</description>
          <addressOffset>0x8020</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8028_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0xc0403020.</description>
          <addressOffset>0x8028</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_802C_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x01000080.</description>
          <addressOffset>0x802C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8070_OPAQUE</name>
          <description>Complete phy_bb_agc_reg_update writes 0x000008c7.</description>
          <addressOffset>0x8070</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8078_CONTROL</name>
          <description>Complete phy_bb_agc_reg_update sets bits 22:20.</description>
          <addressOffset>0x8078</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BB_AGC_UPDATE_SET_UNKNOWN</name>
              <description>Complete phy_bb_agc_reg_update sets all three bits.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
