ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_PHY_RATE_ORACLE</name>
      <description>Wi-Fi-owned PHY words: the noise-floor measurement read by Wi-Fi link
        policy and the low-rate receive gate of Wi-Fi rate control and 11b
        long-range RX. Only Wi-Fi touches these words: no PHY registration,
        calibration or tracking body and no Bluetooth or IEEE 802.15.4 body
        accesses them, so they belong to the Wi-Fi partition rather than the
        shared radio PHY. They share the radio-core base with the PHY oracles.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>NOISE_FLOOR_MEASUREMENT</name>
          <description>Complete phy_read_hw_noisefloor reads this word once, sign-extends the low twelve-bit two's-complement value and divides it arithmetically by four to produce its quarter-dB result. Higher bits are not consumed. Open rev0 HIL read a stable -92 dBm whole-unit result through the complete ROM plus wDev transform.</description>
          <addressOffset>0x708C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SIGNED_SIXTEENTH_DB_CODE</name>
              <description>Signed twelve-bit noise-floor measurement in sixteenth-dB units. The complete ROM arithmetic shift produces quarter-dB and wDev_GetNoiseFloor applies rounded division by four once more before retaining a signed byte; open rev0 HIL observed -92 dBm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW_RATE_PRIMARY_CONTROL</name>
          <description>Complete phy_enable_low_rate sets bits 10 and 11 through separate fresh-read RMW edges; complete phy_disable_low_rate clears them in the same order; complete phy_rx11blr_cfg replaces both with its caller low bit.</description>
          <addressOffset>0x8060</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_RATE_ENABLE_FIRST</name>
              <description>First independently updated low-rate enable bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW_RATE_ENABLE_SECOND</name>
              <description>Second independently updated low-rate enable bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW_RATE_SECONDARY_CONTROL</name>
          <description>Third and final fresh-read RMW in the complete low-rate leaves and phy_rx11blr_cfg.</description>
          <addressOffset>0x807C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_RATE_ENABLE</name>
              <description>Set by complete phy_enable_low_rate and cleared by complete phy_disable_low_rate.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_BASEBAND_CONFIG_ORACLE</name>
      <description>PHY/baseband configuration registers recovered from complete rev0 ROM
        bodies and complete pinned libphy leaves. Operation-derived fields keep
        UNKNOWN where neither public documentation nor an independent symbol
        establishes the electrical meaning.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FRONT_END_AND_TONE_STOP_CONTROL</name>
          <description>Shared word whose bit 2 is set by complete phy_fe_reg_init. Complete phy_start_tx_tone_step clears bits 1:0 and complete phy_stop_tx_tone sets them.</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TONE_STOP_CONTROL_UNKNOWN</name>
              <description>Two-bit field cleared before the ROM power-control tone and set by its complete cleanup; the individual bit meanings are unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FRONT_END_INIT_ENABLE_UNKNOWN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_GAIN_COMPENSATION</name>
          <description>Complete phy_txgain_comp_pacfg_new(1) publishes four ordered byte updates.</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPENSATION_BYTE_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMPENSATION_BYTE_1_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMPENSATION_BYTE_2_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMPENSATION_BYTE_3_UNKNOWN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_GAIN_COMPENSATION_AUX</name>
          <description>Pinned libphy.a[phy_reg.o] phy_start_tx_tone_step_new writes the full zero image while disabling TX-gain compensation.</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>AUXILIARY_IMAGE_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_DC_MEASUREMENT_CONTROL_STATUS</name>
          <description>Complete phy_txdc_cal triggers measurement with bits 1 and 0, polls ready bit 22, samples I and Q comparator bits 29 and 28 through independent reads, then clears bits 1 and 0.</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEASUREMENT_START</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MEASUREMENT_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MEASUREMENT_READY</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Q_COMPARATOR_HIGH</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_COMPARATOR_HIGH</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TONE_PATH_0_CONTROL</name>
          <description>First calibration-tone path word. Complete source bodies prove the packed selector, negated step or attenuation, enable/arm bit and TX-IQ mismatch images; the high nibble is preserved and remains electrically unknown.</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELECTOR_HIGH</name>
              <description>Upper eight bits of the evidenced ten-bit selector; bits 1:0 are in TONE_SELECTOR_CONTROL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOW_RESERVED_CLEAR_UNKNOWN</name>
              <description>Complete tone writers clear these bits; their hardware meaning is unknown.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEGATED_STEP_OR_ATTENUATION</name>
              <description>Two's-complement negated eight-bit tone step or attenuation.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TONE_ENABLE_OR_ARM</name>
              <description>Set by tone start and by each PWDET sample-arm edge; cleared by stop and sample cleanup.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXIQ_MISMATCH_MODE_UNKNOWN</name>
              <description>Three-bit image set to binary 101 for the first mismatch-power polarity and otherwise cleared by general tone setup.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MIDDLE_RESERVED_CLEAR_UNKNOWN</name>
              <description>Complete general and first-polarity tone writers clear these bits.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIQ_POLARITY_IMAGE</name>
              <description>Four-bit mismatch polarity image: first configuration writes bit 26, while the second phase writes nibble 1 or 8.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_NIBBLE_UNKNOWN</name>
              <description>High nibble preserved by all recovered tone updates and retained by the TX-IQ save/restore transaction.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TONE_PATH_1_CONTROL</name>
          <description>Second calibration-tone path word. All currently evidenced calls publish a disabled zero low image while preserving the high nibble.</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELECTOR_HIGH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>SecondToneSelectorHigh</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CLEARED</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOW_RESERVED_CLEAR_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>SecondToneLowReserved</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CLEARED</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEGATED_STEP_OR_ATTENUATION</name>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>SecondToneNegatedStep</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CLEARED</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TONE_ENABLE_OR_ARM</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW_IMAGE_REMAINDER_UNKNOWN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>SecondToneLowImageRemainder</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CLEARED</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIGH_NIBBLE_UNKNOWN</name>
              <description>High nibble preserved by all recovered second-path tone updates.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_GAIN_DC_CONTROL</name>
          <description>Complete rev0 ROM phy_set_rx_gain_cal_dc at 0x2f829858, size
            0x206, sets bits 6:5 before the bounded RX-gain DC calibration
            graph and clears the same pair during the common cleanup tail.
            Their narrower electrical meaning is not independently proved.</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CALIBRATION_ENABLE_UNKNOWN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Common phy_set_rx_gain_cal_dc cleanup value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>phy_set_rx_gain_cal_dc calibration-prefix value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TONE_SELECTOR_CONTROL</name>
          <description>Low two selector bits for each calibration-tone path, updated through separate fresh-read edges.</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PATH_0_SELECTOR_LOW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PATH_1_SELECTOR_LOW</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IQ_CORRECTION_CONTROL</name>
          <description>Shared RX-IQ coefficient and correction-mode word.</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_IQ_GAIN_COEFFICIENT</name>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_IQ_PHASE_COEFFICIENT</name>
              <bitOffset>22</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_IQ_CORRECTION_MODE_LOW</name>
              <description>Low bit of the correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_IQ_CORRECTION_MODE_HIGH</name>
              <description>High bit of the correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRONT_END_INIT_HIGH_UNKNOWN</name>
              <description>Complete phy_fe_reg_init sets bit 31 after the repeated ADC-control writes.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_CLEAR_CONTROL</name>
          <description>Complete phy_fe_reg_init clears bits 8 and 11 in two separately ordered RMW edges.</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_FIRST_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_CLEAR_SECOND_UNKNOWN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_RATE_AND_FRONT_END_CONTROL</name>
          <description>Complete phy_adc_rate_set and phy_dac_rate_set publish rate bit zero into bits 1 and 0 through separate RMW edges. Front-end initialization and update set the same bits in their independently evidenced order.</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC_RATE_LOW_OR_FRONT_END_CONTROL_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_RATE_HIGH_OR_FRONT_END_CONTROL_UNKNOWN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
