ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>POWER_DETECTOR_CONTROL</name>
          <description>Shared PWDET trigger, calibration and background-control word.</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAR_TRIGGER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE_CLEAR_LOW_UNKNOWN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE_CLEAR_MIDDLE_UNKNOWN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE_CLEAR_HIGH_UNKNOWN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIBRATION_FIELD_UNKNOWN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BACKGROUND_CONTROL_ENABLE_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INITIALIZATION_MODE_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_CONTROL_STATUS</name>
          <description>PWDET SAR configuration and three-bit ready status.</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAR_CONFIG_CLEAR_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAR_MODE_UNKNOWN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SAR_READY</name>
              <description>Hardware completion state sampled by the complete power-detector paths; neither source writes these bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_TABLE_0_OPAQUE</name>
          <description>Complete phy_pwdet_reg_init writes 0x0f0f0fff.</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>POWER_DETECTOR_TABLE_1</name>
          <description>Complete initialization writes 0x00ff0f64; TX-DC calibration temporarily replaces the low byte.</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_DC_TEMPORARY_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INITIALIZATION_HIGH_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_REFERENCE</name>
          <description>PWDET reference word; initialization writes 0xaaaa and later paths publish 0, 0x5555 or 0xaaaa.</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>REFERENCE_CODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT</name>
          <description>First of four consecutive SAR result words. phy_get_tone_sar_dout_ consumes its upper thirteen-bit sample; phy_get_fm_sar_dout consumes both thirteen-bit halves from all four words.</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SAR_SAMPLE_LOW</name>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>SAR_SAMPLE</name>
              <bitOffset>17</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_1</name>
          <description>Second of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SAR_SAMPLE_LOW</name>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>SAR_SAMPLE_HIGH</name>
              <bitOffset>17</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_2</name>
          <description>Third of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SAR_SAMPLE_LOW</name>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>SAR_SAMPLE_HIGH</name>
              <bitOffset>17</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_3</name>
          <description>Fourth of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SAR_SAMPLE_LOW</name>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>SAR_SAMPLE_HIGH</name>
              <bitOffset>17</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PA_CONTROL_0</name>
          <description>Shared front-end low byte and PA-on high byte.</description>
          <addressOffset>0x86C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRONT_END_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PA_ON_HIGH_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PA_CONTROL_1</name>
          <description>Complete phy_tx_paon_set publishes 0x0a0e in the high half and 0xc8 in byte one. Complete ble_tx_config_check independently names the low two bytes as Bluetooth RF/PA turn-on delays.</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RF_ON_BT_DELAY_CODE</name>
              <description>Eight-bit RF-on delay code printed by the vendor checker after integer division by 80. The electrical time unit of the raw code is not otherwise assumed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PA_ON_BT_DELAY</name>
              <description>Bluetooth PA-on delay.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PA_ON_HIGH_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SCALE_CONTROL</name>
          <description>Complete ROM tone start clears both byte-wide DAC-scale fields before measurement; complete phy_stop_tx_tone(1) restores both fields to 0xff through separate fresh-read writes.</description>
          <addressOffset>0xC04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAC_SCALE_LOW_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DAC_SCALE_HIGH_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_INIT_0C08</name>
          <description>Both complete source bodies set bit 25 and then bit 26 through separate fresh-read RMW edges.</description>
          <addressOffset>0xC08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_FIRST_UNKNOWN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_SECOND_UNKNOWN</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IQ_CORRECTION_AUX</name>
          <description>Shared TX-IQ coefficient and correction-mode word.</description>
          <addressOffset>0xC0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_IQ_GAIN_COEFFICIENT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_IQ_PHASE_COEFFICIENT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_IQ_CORRECTION_MODE_LOW</name>
              <description>Low bit of the auxiliary correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_IQ_CORRECTION_MODE_HIGH</name>
              <description>High bit of the auxiliary correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRONT_END_INIT_HIGH_UNKNOWN</name>
              <description>Complete phy_fe_reg_init sets bit 15 after the shared correction-mode initialization.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_INIT_0C20</name>
          <description>Final complete phy_fe_reg_init RMW replaces the low byte with 0x57.</description>
          <addressOffset>0xC20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_TX_RATE_CONTROL</name>
          <description>Complete phy_i2c_txrate_init replaces both evidenced rate fields before dispatching TX-gain compensation.</description>
          <addressOffset>0x448C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_RATE_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_RATE_HIGH_UNKNOWN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_CONTROL</name>
          <description>Complete phy_noise_floor_auto_set sets both control bits.</description>
          <addressOffset>0x7018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTO_CONTROL_LOW_UNKNOWN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTO_CONTROL_HIGH_UNKNOWN</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7400</name>
          <description>Complete phy_bb_reg_init sets bits 14:13.</description>
          <addressOffset>0x7400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_UNKNOWN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7428</name>
          <description>Complete phy_bb_reg_init sets bit 14 and replaces bits 13:8 with 0x15.</description>
          <addressOffset>0x7428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_VALUE_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT_ENABLE_UNKNOWN</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_743C</name>
          <description>Complete phy_bb_reg_init clears bits 8:6 through two fresh-read updates.</description>
          <addressOffset>0x743C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_LOW_UNKNOWN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT_CLEAR_HIGH_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_OUTPUT_FILTER_CONTROL</name>
          <description>Complete phy_bbtx_outfilter replaces bits five, six and four through three independent fresh-read RMWs.</description>
          <addressOffset>0x7440</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FILTER_INPUT_2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FILTER_INPUT_0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FILTER_INPUT_1</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_0</name>
          <description>Complete phy_bb_txpwr_track publishes enable plus two initialization fields.</description>
          <addressOffset>0x7454</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRACK_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_CLEAR_UNKNOWN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT_SET_UNKNOWN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_1</name>
          <description>Complete phy_bb_txpwr_track clears bits 1:0 and publishes three eight-bit tracking values.</description>
          <addressOffset>0x7458</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_CLEAR_HIGH_UNKNOWN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACK_VALUE_0_UNKNOWN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_1_UNKNOWN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_2_UNKNOWN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
