ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>TX_POWER_TRACK_CONTROL_2</name>
          <description>Complete phy_bb_txpwr_track publishes four byte-wide tracking values.</description>
          <addressOffset>0x745C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRACK_VALUE_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_1_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_2_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_3_UNKNOWN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_3</name>
          <description>Complete phy_bb_txpwr_track publishes two byte-wide tracking values.</description>
          <addressOffset>0x7460</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRACK_VALUE_0_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRACK_VALUE_1_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCFR_CONTROL</name>
          <description>Complete phy_config_hccfr replaces bit 22 with the low bit of its first argument.</description>
          <addressOffset>0x7468</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Complete phy_config_hccfr writes zero to disable HCCFR and one to enable it.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>HccfrEnable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable HCCFR processing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable HCCFR processing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCFR_VALUE</name>
          <description>Complete phy_config_hccfr replaces the low twelve bits with its second argument.</description>
          <addressOffset>0x746C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete phy_config_hccfr retains the caller value to this twelve-bit field; every representable field image is accepted by the recovered leaf.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICCFR_FORCE_CONTROL</name>
          <description>Complete phy_force_iccfr publishes five fields through five separately ordered fresh-read RMWs.</description>
          <addressOffset>0x7478</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_ENABLE</name>
              <description>Complete phy_force_iccfr writes zero to disable the forced ICCFR value and one to enable it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>IccfrForceEnable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Use the ordinary ICCFR value path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Use the forced ICCFR value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_VALUE</name>
              <description>Complete phy_force_iccfr retains the caller value to this twelve-bit field; every representable field image is accepted by the recovered leaf.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCE_MODE_LOW</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCE_MODE_HIGH</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCE_TRIGGER</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICCFR_ENABLE_CONTROL</name>
          <description>Complete phy_iccfr_en writes three to bits 26:25 for a zero argument and clears them for a nonzero argument.</description>
          <addressOffset>0x747C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GATE</name>
              <description>Complete phy_iccfr_en writes zero for a nonzero enable input and three for a zero input; the other two encodings are not evidenced.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>IccfrGate</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable ICCFR through the recovered zero gate image.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable ICCFR through the recovered all-ones gate image.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7808</name>
          <description>Complete phy_bb_reg_init replaces bits 13:7 with 0x60.</description>
          <addressOffset>0x7808</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_VALUE_UNKNOWN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7890</name>
          <description>Complete phy_bb_reg_init and phy_hemu_ru26_good_res both clear bit 25 then set bit 24 through separate fresh-read RMWs.</description>
          <addressOffset>0x7890</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HE_RU26_GOOD_RESPONSE_ENABLE</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HE_RU26_GOOD_RESPONSE_DISABLE</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_78DC</name>
          <description>Complete phy_bb_reg_init replaces bits 13:7 with two.</description>
          <addressOffset>0x78DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_VALUE_UNKNOWN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_78E4</name>
          <description>Complete phy_bb_reg_init clears bit 22.</description>
          <addressOffset>0x78E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_790C</name>
          <description>Complete phy_bb_reg_init clears bit 11; complete phy_lltf_mask_en independently replaces bits thirteen and twelve; complete phy_chan_dump_cfg replaces bits 7:4 and bit 11 through separate fresh-read RMWs.</description>
          <addressOffset>0x790C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL_DUMP_VALUE_UNKNOWN</name>
              <description>Complete phy_chan_dump_cfg replaces bits 7:4 with the low nibble of its first argument.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT_CLEAR_UNKNOWN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLTF_MASK_INPUT_1</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLTF_MASK_INPUT_0</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7980</name>
          <description>Complete phy_bb_reg_init clears bit 25.</description>
          <addressOffset>0x7980</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_UNKNOWN</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7A28</name>
          <description>Complete phy_bb_reg_init clears bit 22.</description>
          <addressOffset>0x7A28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_CLEAR_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_TX_PA_CONTROL</name>
          <description>Complete phy_bb_reg_init sets bit 9; complete phy_tx_paon_set replaces bits 20:11; complete phy_chan_dump_cfg replaces bit 30 with the low bit of its second argument.</description>
          <addressOffset>0x7C00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASEBAND_INIT_ENABLE_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA_ON_FIELD_UNKNOWN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CHANNEL_DUMP_ENABLE_UNKNOWN</name>
              <description>Complete phy_chan_dump_cfg replaces bit 30 with the low bit of its second argument.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_WATCHDOG_STATUS</name>
          <description>Complete phy_bb_wdt_get_status returns one unrestricted full-word read.</description>
          <addressOffset>0x7C08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Complete unrestricted watchdog status value returned by phy_bb_wdt_get_status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_TX_PA_TIMING</name>
          <description>Complete phy_bb_reg_init clears bits 19:12; complete phy_tx_paon_set replaces bits 9:0 with 0x1e.</description>
          <addressOffset>0x7C30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PA_ON_TIMING_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BASEBAND_INIT_CLEAR_UNKNOWN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_WATCHDOG_CONTROL</name>
          <description>Complete phy_bb_wdg_cfg publishes low configuration 0x00aa and sets bit 30.</description>
          <addressOffset>0x7C3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WATCHDOG_CONFIG_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WATCHDOG_CONTROL_UNKNOWN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_WATCHDOG_ENABLE</name>
          <description>Complete phy_bb_wdg_cfg sets bit 31. The standalone watchdog leaves replace bits 31 and 30 and set timeout-clear bit 29.</description>
          <addressOffset>0x7C40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WATCHDOG_TIMEOUT_CLEAR</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WATCHDOG_INTERRUPT_ENABLE</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WATCHDOG_ENABLE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_ENABLE_0</name>
          <description>Complete phy_noise_floor_auto_set sets bit zero.</description>
          <addressOffset>0x7C44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTO_ENABLE_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_ENABLE_1</name>
          <description>Complete phy_noise_floor_auto_set sets bit zero.</description>
          <addressOffset>0x7C50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTO_ENABLE_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PA_TABLE_OPAQUE</name>
          <description>Complete phy_tx_paon_set writes 0x0661a45f.</description>
          <addressOffset>0x7C6C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>BASEBAND_INIT_7CA8</name>
          <description>Complete phy_bb_reg_init sets bit 20.</description>
          <addressOffset>0x7CA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_ENABLE_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7CD0</name>
          <description>Complete phy_bb_reg_init sets both nibbles to 0xf; complete phy_btbb_wifi_bb_cfg2 preserves low bit two, sets the other low bits and sets the high nibble.</description>
          <addressOffset>0x7CD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_LOW_UNKNOWN_1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_LOW_BIT_2_UNKNOWN</name>
              <description>Complete phy_btbb_wifi_bb_cfg2 preserves this bit while setting the other low-nibble bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_LOW_UNKNOWN_3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_HIGH_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
