ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_IQ_ESTIMATOR_ORACLE</name>
      <description>DC/IQ estimator configuration, signed result and activity registers
        recovered from complete S31 rev0 ROM bodies and the complete pinned
        phy_check_rx_sat blob leaf. Unknown electrical roles remain explicit.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>ESTIMATOR_CONFIG</name>
          <description>Complete phy_iq_est_enable replaces bits 27:26 with encoding one before each measurement.</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_MODE_UNKNOWN</name>
              <description>Two-bit field set to encoding one by phy_iq_est_enable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_CONTROL</name>
          <description>Complete phy_iq_est_enable publishes the caller control word and starts both measurement phases; complete phy_iq_est_disable clears them in reverse order around a one-microsecond delay.</description>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MEASUREMENT_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_WINDOW_UNKNOWN</name>
              <description>Fifteen-bit caller value shifted left by two.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>15</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>32767</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE_UNKNOWN</name>
              <description>Complete phy_iq_est_enable replaces the field with encoding two.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_I</name>
          <description>Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed estimator result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_I</name>
          <description>Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed estimator result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_Q</name>
          <description>Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed estimator result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_Q</name>
          <description>Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed estimator result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_I_ACCUMULATOR</name>
          <description>First signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x464</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed accumulator value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_Q_ACCUMULATOR</name>
          <description>Second signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed accumulator value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER_ACCUMULATOR</name>
          <description>Signed power accumulator consumed by complete phy_dc_iq_est, phy_rxiq_get_mis and phy_set_rx_gain_cal_iq.</description>
          <addressOffset>0x46C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Complete signed accumulator value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_READY_STATUS</name>
          <description>Complete phy_iq_est_enable tests bit 16 before leaving its readiness loop.</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_ACTIVITY_STATUS</name>
          <description>Complete phy_iq_est_enable counts nonzero bits 21:20 while waiting; complete phy_check_rx_sat samples the same field exactly 100 times.</description>
          <addressOffset>0x8D0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACTIVITY_UNKNOWN</name>
              <description>Nonzero is treated as IQ-estimator activity and as an RX-saturation sample.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
