ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_RX_DCO_ORACLE</name>
      <description>RX-DCO calibration control word recovered from complete pinned S31
        blob and rev0 ROM calibration bodies.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Complete phy_xtal_duty_cal and RX-DCO calibration bodies save, clear and restore bits 23:22 around measurement.</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CALIBRATION_CONTROL_UNKNOWN</name>
              <description>Two-bit field preserved around the complete bounded RX-DCO measurement graph.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_COLD_DEADLINE_ORACLE</name>
      <description>Free-running word sampled by the complete rev0 ROM SDM-stability
        deadline. The instruction body proves its address and unsigned
        wraparound consumer, but not its hardware clock source.</description>
      <baseAddress>0x2010D800</baseAddress>
      <registers>
        <register>
          <name>DEADLINE_COUNTER_UNKNOWN</name>
          <description>Complete phy_wait_i2c_sdm_stable samples this full word before and after each independently completed PHY-I2C read.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Full-width wrapping deadline value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_CLOCK_ORACLE</name>
      <description>OPAQUE PHY clock-gate
        registers recovered from complete no-call ROM/blob leaves.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FE_CLOCK_GATE_OPAQUE</name>
          <description>ROM writes 0x1e7 to open and the blob writes zero to close.</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Complete observed front-end clock-gate images; constituent gate meanings remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>CLOSED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN</name>
                  <value>487</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TABLE_MEMORY_INDEX_SOURCE</name>
          <description>Shared word contains the table-memory base index and the complete phy_force_pwr_index controls.</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCED_DIGITAL_GAIN_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCED_DIGITAL_GAIN_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCE_DIGITAL_GAIN_ENABLE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCED_POWER_INDEX</name>
              <description>Complete phy_force_pwr_index replaces bits 22:17 with the low six bits of its second argument.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCE_POWER_ENABLE</name>
              <description>Complete phy_force_pwr_index replaces bit 23 with the low bit of its first argument.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BASE_INDEX</name>
              <description>Eight-bit table-memory base index; the complete front-end initializer writes 0xa0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FE_BB_CLOCK_CONTROL_OPAQUE</name>
          <description>ROM sets bits 1:0 and the blob clears them.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ROM_FE_BB_ENABLE_UNKNOWN</name>
              <description>Two-bit open/close mask; individual meanings are unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>CLOSED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY_CALIBRATION_CLOCK_UNKNOWN</name>
              <description>The phy_bb_init parent sets bit 2 before calibration; the individual hardware meaning remains unknown.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BB_CLOCK_GATE_OPAQUE</name>
          <description>ROM writes all ones to open and the blob writes zero to close.</description>
          <addressOffset>0x7C80</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Complete observed baseband clock-gate images; constituent gate meanings remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>CLOSED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN</name>
                  <value>4294967295</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
