ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU_RADIO</name>
      <description>Route-owned PMU words used by the reviewed shared radio clock, RF-power and analog-I2C lifecycles. Unrelated PMU words remain platform-owned.</description>
      <baseAddress>0x20704000</baseAddress>
      <registers>
        <register>
          <name>HP_ACTIVE_ICG_MODEM</name>
          <description>Active-state modem clock-gating selection.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HP_ACTIVE_DIG_ICG_MODEM_CODE</name>
              <description>Two-bit active-state modem clock-gating code; official ESP-HAL publishes code two for the active configuration.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>ActiveModemIcgCode</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Active-state modem clock-gating code published by official ESP-HAL.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ACTIVE_HP_CK_POWER</name>
          <description>Active-state high-power clock and analog-I2C power control reached by the complete front-end/baseband clock body.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROM_OPEN_FE_BB_UNKNOWN_LOW</name>
              <description>Low-nibble image set by complete rev0 ROM phy_open_fe_bb_clk; individual bit semantics remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>FrontEndBasebandClockImage</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>ROM_REQUIRED</name>
                  <description>Complete low-nibble image published by the rev0 ROM front-end/baseband clock leaf.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_ACTIVE_XPD_BB_I2C</name>
              <description>Active-state baseband analog-I2C power control.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_CK_POWER_0</name>
          <description>Immediate high-power clock ties. The reviewed complete PHY body reads this word before its preserving update, overriding the write-only access class in the uncorrected public SVD.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIE_HIGH_XPD_BB_I2C</name>
              <description>Force the baseband analog-I2C power control high.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHY_RF_SHUTDOWN_UNKNOWN_HIGH</name>
              <description>Upper three-bit immediate-clock image cleared together with TIE_HIGH_XPD_BB_I2C by complete ESP32-S31 phy_xpd_rf_new; individual hardware meanings remain unknown.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_SLEEP_SYSCLK</name>
          <description>Immediate sleep/system-clock update commands.</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_SWITCH</name>
              <description>Publish the selected digital clock-gating switch state.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMM_MODEM_ICG</name>
          <description>Immediate modem clock-gating update command.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDATE_DIG_ICG_MODEM_EN</name>
              <description>Publish the selected digital modem clock-gating state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_PWC</name>
          <description>RF circuit power control.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPD_RF_CIRCUIT</name>
              <description>Sixteen RF circuit power-control bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>RfCircuitPower</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>POWERED_OFF</name>
                  <description>Clear every reviewed RF circuit power-control bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_ON</name>
                  <description>Set every reviewed RF circuit power-control bit.</description>
                  <value>65535</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_PERI_PWR_CTRL</name>
          <description>Analog peripheral I2C power and active-low reset control.</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>XPD_PERIF_I2C</name>
              <description>Analog peripheral I2C power control.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTB_PERIF_I2C</name>
              <description>Analog peripheral I2C active-low reset release.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
