ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_SYS_CLKRST_RADIO</name>
      <description>Route-owned high-power system clock/reset words shared by the reviewed Wi-Fi, Bluetooth and IEEE 802.15.4 lifecycles. Unrelated HP_SYS_CLKRST words remain platform-owned.</description>
      <baseAddress>0x20587000</baseAddress>
      <registers>
        <register>
          <name>MODEM_CTRL0</name>
          <description>Modem control/register-bus clock gate.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MODEM_CLK_EN</name>
              <description>Modem control/register-bus clock enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_160M_CTRL0</name>
          <description>160 MHz reference divider and clock gate.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000102</resetValue>
          <fields>
            <field>
              <name>REF_160M_CLK_DIV_NUM</name>
              <description>160 MHz reference divider programmed by the platform clock tree.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>Ref160mDivider</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>FIXED_480MHZ_SOURCE</name>
                  <description>Divider image two programmed by official ESP-HAL for the fixed 480 MHz BBPLL source.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REF_160M_CLK_EN</name>
              <description>160 MHz reference clock gate shared by the radio lifecycles.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CONF</name>
          <description>Modem APB, reset and source-clock configuration.</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000025</resetValue>
          <fields>
            <field>
              <name>MODEM_APB_CLK_EN</name>
              <description>Modem APB clock enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_RST_EN</name>
              <description>Modem subsystem reset assertion.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_CLK_EN</name>
              <description>Modem source-clock enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_CLK_SOURCE_SEL</name>
              <description>Modem source-clock selector.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_PLL_CLK_EN</name>
              <description>Modem PLL clock enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_XTAL_CLK_EN</name>
              <description>Modem crystal clock enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MODEM_SYSCON_RADIO</name>
      <description>Route-owned MODEM_SYSCON clocks, resets and shared Wi-Fi-baseband control used by the exclusive Wi-Fi, Bluetooth and IEEE 802.15.4 lifecycles.</description>
      <baseAddress>0x20109C00</baseAddress>
      <registers>
        <register>
          <name>CLK_CONF</name>
          <description>Shared modem clock selectors and protocol clock gates.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00200002</resetValue>
          <fields>
            <field>
              <name>CLK_I2C_MST_SEL_160M</name>
              <description>Select the 160 MHz PHY-I2C-master source.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_ETM_EN</name>
              <description>Enable the modem ETM clock.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_ZB_APB_EN</name>
              <description>Enable the IEEE 802.15.4 APB clock.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_ZBMAC_EN</name>
              <description>Enable the IEEE 802.15.4 MAC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_SEC_ECB_EN</name>
              <description>Enable the modem-security ECB clock.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_SEC_CCM_EN</name>
              <description>Enable the modem-security CCM clock.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_SEC_BAH_EN</name>
              <description>Enable the modem-security BAH clock.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_SEC_APB_EN</name>
              <description>Enable the modem-security APB clock.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_SEC_EN</name>
              <description>Enable the modem-security functional clock.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_BLE_TIMER_EN</name>
              <description>Enable the Bluetooth low-power timer clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF_POWER_ST</name>
          <description>Six modem-domain power-state clock-map fields.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_ZB_ST_MAP_BIT_TWO</name>
              <description>Bit two of the IEEE 802.15.4 domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_ST_MAP_BIT_ONE</name>
              <description>Bit one of the radio-front-end domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_ST_MAP_BIT_TWO</name>
              <description>Bit two of the radio-front-end domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_BT_ST_MAP_BIT_TWO</name>
              <description>Bit two of the Bluetooth domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFI_ST_MAP_BIT_ONE</name>
              <description>Bit one of the Wi-Fi domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFI_ST_MAP_BIT_TWO</name>
              <description>Bit two of the Wi-Fi domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_PERI_ST_MAP_BIT_TWO</name>
              <description>Bit two of the modem-peripheral domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_APB_ST_MAP_BIT_ONE</name>
              <description>Bit one of the modem-APB domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_MODEM_APB_ST_MAP_BIT_TWO</name>
              <description>Bit two of the modem-APB domain state map, set by the reviewed modem clock initialization.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_RST_CONF</name>
          <description>Shared radio-domain reset controls.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST_WIFIBB</name>
              <description>Wi-Fi baseband reset.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_WIFIMAC</name>
              <description>Wi-Fi MAC reset.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_BTMAC_APB</name>
              <description>Bluetooth MAC APB reset.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_BTMAC</name>
              <description>Bluetooth MAC reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_ZBMAC_APB</name>
              <description>IEEE 802.15.4 MAC APB reset.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_ZBMAC</name>
              <description>IEEE 802.15.4 MAC reset.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_MODEM_ECB</name>
              <description>Modem-security ECB reset.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_MODEM_CCM</name>
              <description>Modem-security CCM reset.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_MODEM_BAH</name>
              <description>Modem-security BAH reset.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_MODEM_SEC</name>
              <description>Modem-security reset.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_BLE_TIMER</name>
              <description>Bluetooth low-power timer reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF1</name>
          <description>Wi-Fi, Bluetooth and front-end clock gates.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_WIFIBB_22M_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_40M_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_44M_EN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_80M_EN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_40X_EN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_80X_EN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_40X1_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_80X1_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIBB_160X1_EN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIMAC_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFI_APB_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_80M_EN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_160M_EN</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_APB_EN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_BT_APB_EN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_BTBB_EN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_BTMAC_EN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_PWDET_ADC_EN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_ADC_EN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_FE_DAC_EN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_BB_CFG</name>
          <description>Instruction-reviewed Wi-Fi baseband shared control.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COLD_START_CLEAR_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIFI_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSS_CBW_40_DIGITAL_UNKNOWN</name>
              <description>Reviewed digital BSS 40 MHz channel-width control; zero disables and one enables the recovered path.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_AGC_UPDATE_ENABLE_UNKNOWN</name>
              <description>Reviewed baseband AGC update mode used by initialization and subsequent register updates.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>INITIALIZATION</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGISTER_UPDATES_ENABLED</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAC_BASEBAND_ENABLE_UNKNOWN</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
