ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MODEM_LPCON_SHARED_CLOCK</name>
      <description>Role-neutral MODEM_LPCON clock-map, gate and low-power selector registers shared by the exclusive Wi-Fi, Bluetooth and IEEE 802.15.4 routes.</description>
      <baseAddress>0x2010F000</baseAddress>
      <registers>
        <register>
          <name>LP_TIMER_CONF</name>
          <description>Bluetooth low-power timer source selector and twelve-bit divider.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_LP_TIMER_SEL_OSC_SLOW</name>
              <description>Select the slow oscillator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_TIMER_SEL_OSC_FAST</name>
              <description>Select the fast oscillator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_TIMER_SEL_XTAL</name>
              <description>Select the crystal clock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_TIMER_SEL_XTAL32K</name>
              <description>Select the 32 kHz crystal clock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_TIMER_DIV_NUM</name>
              <description>Twelve-bit low-power timer divider image.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_LP_CLK_CONF</name>
          <description>Coexistence low-power source selector and twelve-bit divider sampled by the coexistence time conversion.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_COEX_LP_SEL_OSC_SLOW</name>
              <description>Select the slow oscillator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_LP_SEL_OSC_FAST</name>
              <description>Select the fast oscillator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_LP_SEL_XTAL</name>
              <description>Select the crystal clock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_LP_SEL_XTAL32K</name>
              <description>Select the 32 kHz crystal clock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_LP_DIV_NUM</name>
              <description>Twelve-bit coexistence low-power clock divider image.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF</name>
          <description>Shared MODEM_LPCON clock gates used by radio lifecycles.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_WIFIPWR_EN</name>
              <description>Wi-Fi power clock gate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_EN</name>
              <description>Coexistence clock gate.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_I2C_MST_EN</name>
              <description>PHY I2C master clock gate.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_TIMER_EN</name>
              <description>Bluetooth low-power timer clock gate.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF_POWER_ST</name>
          <description>Four shared clock power-state map fields programmed with the reviewed active-state image.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_WIFIPWR_ST_MAP_BIT_ONE</name>
              <description>Bit one of the Wi-Fi-power clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_WIFIPWR_ST_MAP_BIT_TWO</name>
              <description>Bit two of the Wi-Fi-power clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_ST_MAP_BIT_ONE</name>
              <description>Bit one of the coexistence clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_COEX_ST_MAP_BIT_TWO</name>
              <description>Bit two of the coexistence clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_I2C_MST_ST_MAP_BIT_ONE</name>
              <description>Bit one of the PHY-I2C-master clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_I2C_MST_ST_MAP_BIT_TWO</name>
              <description>Bit two of the PHY-I2C-master clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_APB_ST_MAP_BIT_ONE</name>
              <description>Bit one of the low-power APB clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_LP_APB_ST_MAP_BIT_TWO</name>
              <description>Bit two of the low-power APB clock state map, set by the reviewed shared active-state initialization.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
