ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MODEM_LPCON_PHY_TICK</name>
      <description>Role-neutral MODEM_LPCON tick target used by the reviewed common-PHY prelude. Other MODEM_LPCON registers remain platform-owned.</description>
      <baseAddress>0x2010F000</baseAddress>
      <registers>
        <register>
          <name>TICK_CONF</name>
          <description>Fixed-crystal modem-power tick target published by complete phy_get_xtal_freq.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000027</resetValue>
          <fields>
            <field>
              <name>MODEM_PWR_TICK_TARGET</name>
              <description>Six-bit target replaced with crystal_frequency_mhz minus one by complete phy_get_xtal_freq.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AON_CLKRST</name>
      <description>Low-power always-on clock/reset registers reached by the reviewed PHY power-detector lifecycle.</description>
      <baseAddress>0x20701000</baseAddress>
      <registers>
        <register>
          <name>RTC_SAR2_PWDET_CCT</name>
          <description>SAR2 power-detector circuit mode. Only encodings two and four are published by reviewed complete ROM bodies.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC_SAR2_PWDET_CCT</name>
              <description>Three-bit power-detector circuit-mode field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_PERICLKRST</name>
      <description>Low-power peripheral clock/reset registers reached by the reviewed PHY temperature-sensor initializer.</description>
      <baseAddress>0x20710000</baseAddress>
      <registers>
        <register>
          <name>TSENS_CTRL</name>
          <description>Low-power temperature-sensor clock and reset control.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LP_TSENS_CLK_EN</name>
              <description>Temperature-sensor peripheral clock enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LP_TSENS_RST_EN</name>
              <description>Temperature-sensor peripheral reset enable; modeled for exact register geometry but not written by this slice.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TSENS</name>
      <description>Low-power temperature sensor reached by reviewed complete ROM and libphy bodies.</description>
      <baseAddress>0x20818000</baseAddress>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Temperature-sensor sample and power control.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00019400</resetValue>
          <fields>
            <field>
              <name>OUT</name>
              <description>Unsigned temperature-sensor code sampled once by the complete ROM read leaves.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>Temperature-sensor ready observation; not consumed by this slice.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPLE_EN</name>
              <description>Temperature sample enable; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP_MASK</name>
              <description>Temperature wakeup mask; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT_EN</name>
              <description>Temperature interrupt enable; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_INV</name>
              <description>Input inversion control; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>Temperature-sensor clock divider; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>POWER_UP</name>
              <description>Temperature-sensor power control set by complete ROM phy_set_tsens_power_.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POWER_UP_FORCE</name>
              <description>Forced power control; modeled for exact geometry but not written by this slice.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF</name>
          <description>Temperature-sensor register-bank and PHY read-path control.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Temperature-sensor register-bank clock enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHY_CONVERSION_ENABLE_UNKNOWN</name>
              <description>Blob-evidenced conversion-path enable; the individual hardware meaning remains unknown.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHY_READOUT_ENABLE_UNKNOWN</name>
              <description>Blob-evidenced readout-path enable; the individual hardware meaning remains unknown.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
