ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_CRYPTO_CONTROL</name>
      <description>Per-interface hardware-crypto controls, shared policy mask and key
        validity bitmap recovered from complete libpp hal_crypto leaves.</description>
      <baseAddress>0x20104800</baseAddress>
      <registers>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>INTERFACE_CONTROL%s</name>
          <description>STA, AP and NAN interface controls selected by hal_crypto_enable. The open STA CCMP path writes the complete image 0x00030103, then clears bits 31:30.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONTROL_LOW_UNKNOWN</name>
              <description>Algorithm, enable and management-frame policy fields composed by the complete leaf; individual electrical meanings remain partly unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE_HIGH_UNKNOWN</name>
              <description>Complete ordinary enable clears both high bits; one algorithm branch sets bit 31.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>POLICY_CONTROL</name>
          <description>Shared policy word. The ordinary non-algorithm-four enable path preserves bits 31:22 and 5:0 while clearing bits 21:6.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_POLICY_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ORDINARY_ENABLE_CLEAR_UNKNOWN</name>
              <description>Cleared by the reachable STA CCMP enable transaction.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_POLICY_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_AUX_UNKNOWN</name>
          <description>Fourth full-word cold-init store, cleared by complete hal_crypto_init. Its algorithm-specific meaning is not yet recovered.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_VALID_BITMAP</name>
          <description>One validity bit per one of the 25 evidenced hardware key entries.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENTRY_0_VALID</name>
              <description>Validity of key-table entry zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_1_VALID</name>
              <description>Validity of key-table entry one.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_2_VALID</name>
              <description>Validity of key-table entry two.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_3_VALID</name>
              <description>Validity of key-table entry three.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_4_VALID</name>
              <description>Validity of key-table entry four.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_5_VALID</name>
              <description>Validity of key-table entry five.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_6_VALID</name>
              <description>Validity of key-table entry six.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_7_VALID</name>
              <description>Validity of key-table entry seven.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_8_VALID</name>
              <description>Validity of key-table entry eight.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_9_VALID</name>
              <description>Validity of key-table entry nine.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_10_VALID</name>
              <description>Validity of key-table entry ten.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_11_VALID</name>
              <description>Validity of key-table entry eleven.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_12_VALID</name>
              <description>Validity of key-table entry twelve.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_13_VALID</name>
              <description>Validity of key-table entry thirteen.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_14_VALID</name>
              <description>Validity of key-table entry fourteen.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_15_VALID</name>
              <description>Validity of key-table entry fifteen.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_16_VALID</name>
              <description>Validity of key-table entry sixteen.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_17_VALID</name>
              <description>Validity of key-table entry seventeen.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_18_VALID</name>
              <description>Validity of key-table entry eighteen.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_19_VALID</name>
              <description>Validity of key-table entry nineteen.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_20_VALID</name>
              <description>Validity of key-table entry twenty.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_21_VALID</name>
              <description>Validity of key-table entry twenty-one.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_22_VALID</name>
              <description>Validity of key-table entry twenty-two.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_23_VALID</name>
              <description>Validity of key-table entry twenty-three.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRY_24_VALID</name>
              <description>Validity of key-table entry twenty-four.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_HIGH</name>
              <description>Reserved bits 31:25. Complete validity writes publish zero here.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>0</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
