ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_TB_STATISTICS</name>
      <description>Hardware counters read by the complete hal_he_get_rx_trigger_cnt, hal_he_get_tb_times_cnt and hal_he_get_tb_qosnull_cnt leaves. These counters distinguish Trigger reception from actual trigger-based transmission and appended QoS Null responses. An ordinary controlled HE SU AP produced no Trigger frames, so all three remained zero during sustained HE DCM A-MPDU traffic.</description>
      <baseAddress>0x201043A0</baseAddress>
      <registers>
        <register>
          <name>RX_TRIGGER</name>
          <description>Complete hal_he_get_rx_trigger_cnt returns the low sixteen bits.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COUNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>HIGH_COUNT_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TB_TRANSMISSION</name>
          <description>Complete hal_he_get_tb_times_cnt returns the low sixteen bits; complete hal_he_get_tb_qosnull_cnt returns the high sixteen bits.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COUNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>QOS_NULL_COUNT</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_TB_DIAGNOSTICS</name>
      <description>Four read-only hardware result words decoded by complete dbg_read_axtb_diag and its four complete getter leaves. The names come from the pinned blob's own format strings; no field meaning is inferred from reset images. All four words remained zero when the controlled AP sent no Trigger frames.</description>
      <baseAddress>0x201044F4</baseAddress>
      <registers>
        <register>
          <name>TIMING</name>
          <description>WDEVAXTBDIAG0.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TX_TIME</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SYMBOL_COUNT</name>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PRE_FEC_PADDING_PHY</name>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSDU</name>
          <description>WDEVAXTBDIAG1.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PSDU_LENGTH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>MINIMUM_SUBFRAME_LENGTH</name>
              <bitOffset>17</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PACKET_EXTENSION_TIME</name>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>WDEVAXTBDIAG2.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TX_20_PACKET_COUNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>QOS_NULL_APPEND_COUNT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRIGGER_TYPE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>UPLINK_LENGTH</name>
              <bitOffset>15</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>GI_AND_LTF</name>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TID_LIMIT</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USER</name>
          <description>WDEVAXTBDIAG3.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ASSOCIATION_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>RU_ALLOCATION</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>UPLINK_MCS</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BASIC_PREFERRED_AC</name>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BASIC_SPACING_FACTOR</name>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UPLINK_PACKET_EXTENSION</name>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
