ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_BUFFER_STATUS</name>
      <description>Eight interleaved hardware/software Buffer Status Report values and their shared control. Complete dbg_read_bsr_info names every exposed field. Complete hal_he_get_hw_txq_bsr independently proves the eight-byte stride and low twenty-bit hardware value. The independent blob and ROM mac_tx_set_tb bodies prove the write-side scheduler interpretation: for logical queues zero through three they replace the corresponding software BSR low twenty bits with the sum of every linked frame-state halfword at offset 0x22, then OR the queue bit into CONTROL[7:0]. Complete dbg_read_tx_ppdu independently names that exact halfword msdu_len, proving that this is an original-MSDU byte sum rather than MPDU, PSDU or encoded A-MPDU length. Complete HE BlockAck response/deletion paths separately select and clear TID_BITMAP bits through hal_he_set_tid_bitmap and hal_he_clr_tid_bitmap. Open HE HIL observed TID_BITMAP=1 immediately after the successful TID0 AddBA transition while sustained DCM A-MPDU remained clean. A later rev0 HIL reproduced the complete ROM write order with a 47104-byte TID0 queue: CONTROL validity read back one while SOFTWARE_BSR already read zero. This qualifies the write-side address and validity edge but leaves the zero as a live-update/read-latch ambiguity until a real AP Trigger is observed.</description>
      <baseAddress>0x20104D74</baseAddress>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>HARDWARE_BSR%s</name>
          <description>WDEVTXQBSR_HW[0-7].</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SOFTWARE_BSR%s</name>
          <description>WDEVTXQBSR_SW[0-7]. The debug decoder reads all eight low-twenty-bit values. Complete blob and ROM mac_tx_set_tb independently prove write semantics for logical queues zero through three: preserve bits 31:20 and replace VALUE with the sum of linked frame-state +0x22 halfwords before publishing the queue-ready bit. Complete dbg_read_tx_ppdu names that halfword msdu_len. Rev0 open HIL programmed 47104 for logical queue two with the exact ROM sequence, then observed VALUE zero immediately after validity became visible. Treat reads as live hardware state rather than durable software-write readback until a Trigger HIL resolves whether the value was consumed or rejected.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Software BSR value. On the recovered Trigger-based TX path this is the low-twenty-bit sum of the original MSDU lengths from linked frame-state +0x22, not the encoded MPDU/PSDU lengths.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL</name>
          <description>WDEVTXQBSR_CTRL. Complete dbg_read_bsr_info decodes all fields below. Complete blob and ROM mac_tx_set_tb perform a fresh-read RMW that ORs 1&lt;&lt;logical_queue into bits 7:0 after the queue configuration and software BSR value are visible; the debug function names these bits WDEVTXQBSR_VD[0-7], so the neutral validity name is retained. Complete hal_he_set_tid_bitmap and hal_he_clr_tid_bitmap independently update TID_BITMAP through two fresh reads followed by one write. Open HE HIL qualified the TID0 set edge after successful AddBA and later read back logical queue two validity immediately after the exact ROM publication sequence.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALID_0</name>
              <description>WDEVTXQBSR_VD[0]. Complete mac_tx_set_tb also proves this is the write-side Trigger-ready bit for logical queue zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_1</name>
              <description>WDEVTXQBSR_VD[1]. Complete mac_tx_set_tb also proves this is the write-side Trigger-ready bit for logical queue one.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_2</name>
              <description>WDEVTXQBSR_VD[2]. Complete mac_tx_set_tb also proves this is the write-side Trigger-ready bit for logical queue two.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_3</name>
              <description>WDEVTXQBSR_VD[3]. Complete mac_tx_set_tb also proves this is the write-side Trigger-ready bit for logical queue three.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_4</name>
              <description>WDEVTXQBSR_VD[4]. No write-side queue interpretation is currently claimed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_5</name>
              <description>WDEVTXQBSR_VD[5]. No write-side queue interpretation is currently claimed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_6</name>
              <description>WDEVTXQBSR_VD[6]. No write-side queue interpretation is currently claimed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID_7</name>
              <description>WDEVTXQBSR_VD[7]. No write-side queue interpretation is currently claimed.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_EMPTY_SOFTWARE_TID</name>
              <description>TID used when AC_EMPTY_USE_SW_TID is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AC_EMPTY_USE_SOFTWARE_TID</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_0_ENABLED</name>
              <description>Trigger-based TID zero enabled by successful HE BlockAck setup.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_1_ENABLED</name>
              <description>Trigger-based TID one enabled by successful HE BlockAck setup.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_2_ENABLED</name>
              <description>Trigger-based TID two enabled by successful HE BlockAck setup.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_3_ENABLED</name>
              <description>Trigger-based TID three enabled by successful HE BlockAck setup.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_4_ENABLED</name>
              <description>Trigger-based TID four enabled by successful HE BlockAck setup.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_5_ENABLED</name>
              <description>Trigger-based TID five enabled by successful HE BlockAck setup.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_6_ENABLED</name>
              <description>Trigger-based TID six enabled by successful HE BlockAck setup.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_TID_7_ENABLED</name>
              <description>Trigger-based TID seven enabled by successful HE BlockAck setup.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BASIC_SPECIAL_BSR_SEQUENCE</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TID_LIMIT_ZERO_BSR_SEQUENCE</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
