ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_INIT_SUFFIX</name>
      <description>Complete hardware-visible hal_he_init suffix after dbg_read_tx_power, including all reached leaves. It contains 163 ordered writes/RMWs plus the two multi-BSSID guard reads.</description>
      <baseAddress>0x20104020</baseAddress>
      <registers>
        <register>
          <name>MULTI_BSSID_CONTROL</name>
          <description>WDEV_HE_BSSID0_CONF. Complete dbg_read_rx_misc names the BSSID byte, multi-BSSID, co-hosted and HE BSS-color fields. Complete hal_he_bssid_init sets HE_BSSID_ENABLE and clears BSSID_SELECT for interface zero before its power-save tail; open associated-STA HIL read those values as one and zero. Complete initialization, clear and co-hosted leaves independently update the low fields.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BSSID_BYTE_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MULTI_BSSID_ENABLE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTI_BSSID_MASK</name>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CO_HOSTED_ENABLE</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NONTRANSMITTED_BSSID_WAKEUP_ONLY</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSS_COLOR</name>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BSS_COLOR_ENABLE</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PARTIAL_BSS_COLOR_ENABLE</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSSID_SELECT</name>
              <description>Complete hal_he_bssid_init clears both selector bits for interface zero after enabling HE BSSID matching; dbg_read_rx_misc names the two-bit field HE_BSSID_IDX.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HE_BSSID_ENABLE</name>
              <description>Complete hal_he_bssid_init sets bit 31 for interface zero before clearing BSSID_SELECT; hal_he_bssid_deinit clears it, and dbg_read_rx_misc names it HE_BSSID_EN.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_BSSID_HIGH</name>
          <description>Complete clear leaf clears bits 23:16.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HIGH_ADDRESS_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_BSSID_CONTROL_INTERFACE_1</name>
          <description>When hal_he_get_bss_color selects interface one, BSS_COLOR_ENABLE gates the returned six-bit BSS color from this word. Other fields remain unnamed.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BSS_COLOR</name>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSS_COLOR_ENABLE</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BROADCAST_RU_LOW</name>
          <description>Complete hal_he_set_bcast_ru(0x7fd,0,0) sets enable bit 22 then replaces the adjacent eleven-bit value.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASSOCIATION_ID</name>
              <description>Interface-zero AID copied into the low eleven bits by the complete association leaf.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VALUE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BROADCAST_RU_HIGH</name>
          <description>Complete hal_he_set_bcast_ru independently sets bit 11, replaces bits 10:0, sets bit 23 and replaces bits 22:12.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOW_ENABLE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_VALUE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_ENABLE</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_MODE_CONTROL</name>
          <description>Parent replaces bits 31:30 with one after the HE scratch clear.</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE_UNKNOWN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DUMP_COMPLETE_HESIGB</name>
          <description>Complete disable leaf clears bit zero.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERSU_ACK_RATE</name>
          <description>Complete hal_he_set_ersu_ack_rate writes the same byte through four separate fresh-read RMWs: argument zero selects 0x80 and nonzero selects 0xa0. Complete trc_set_bf_report_rate calls this leaf after publishing BF_REPORT_RATE, selecting 0xa0 only for its low-link-metric DCM plus ER-SU branch.</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RATE_0</name>
              <description>First byte written by hal_he_set_ersu_ack_rate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RATE_1</name>
              <description>Second byte written by hal_he_set_ersu_ack_rate.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RATE_2</name>
              <description>Third byte written by hal_he_set_ersu_ack_rate.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RATE_3</name>
              <description>Fourth byte written by hal_he_set_ersu_ack_rate.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ERSU_AND_VHT_CONTROL</name>
          <description>Complete dbg_read_bsr_info names bits 8:2 and the comparison method. Complete dbg_read_rx_misc names bits 9:11. Complete dbg_tb_ignore_cca_enable proves that bit 12 set means TB respects CCA and NAV, while clearing it enables the debug ignore mode. Complete hal_he_bsr_init initializes the BSR comparison method and control bits. The HE Operation ER-SU-Disable bit at complete-IE byte five bit zero controls bit 10 through complete hal_he_set_ersu. VHT bandwidth-signaling RTS disable later clears bit 22.</description>
          <addressOffset>0xC5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BSR_ACI_HIGH_COMPARISON_METHOD</name>
              <description>Complete init replaces the field with one; complete get/set leaves prove its width; complete dbg_read_bsr_info names the field CMP_BSR_METHOD.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PREAC_DISABLE_LOW_AC_TX_WHEN_EMPTY</name>
              <description>Complete dbg_read_bsr_info names this PREAC_DIS_LOWACTX EMPTY.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PREAC_DISABLE_LOW_AC_TX_WHEN_NO_RESOURCE</name>
              <description>Complete dbg_read_bsr_info names this PREAC_DIS_LOWACTX NORES.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_EMPTY_SINGLE_BSR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PREAC_NO_RESOURCE_ENABLE_BSR</name>
              <description>Complete dbg_read_bsr_info names this PREAC_NORES_ENA_BSR.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QOS_DATA_UPDATE_BSR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IGNORE_VALID_TB</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IGNORE_VALID_EDCA</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB_NO_RESOURCE_CONTINUE_TX</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTO_ACK_ALLOW_ERSU</name>
              <description>Complete dbg_read_rx_misc names the bit AUTOACK_ALLOW_ERSU. Complete hal_he_set_ersu clears it for a nonzero HE Operation ER-SU argument and sets it for zero; the PAC preserves that counterintuitive instruction-exact polarity.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HE_RESPONSE_ACK</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB_CARE_CCA_AND_NAV</name>
              <description>Complete dbg_tb_ignore_cca_enable clears this bit and logs "tb ignore CCA and NAV" for a nonzero argument; it sets the bit and logs "tb care CCA and NAV" for zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSR_ENABLE</name>
              <description>Complete hal_he_bsr_init sets this bit; complete hal_he_bsr_ctrl controls it.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VHT_BW_SIGNALING_RTS</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HE_PACKET_PADDING</name>
          <description>Five five-bit NOMINAL_PKT_PADDING values decoded by complete dbg_read_rx_misc and derived from the peer HE capability.</description>
          <addressOffset>0xC70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BPSK_DURATION</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QPSK_DURATION</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QAM16_DURATION</name>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QAM64_DURATION</name>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QAM256_DURATION</name>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HE_DEFAULT_CONTROL</name>
          <description>Canonical WDEVAXOPTIONS2 register. Parent replaces MPDU_LENGTH_OFFSET bits 11:3 with 0x17c after minimum-power setup. Complete hal_he_set_default_pe replaces bits 2:0 with the low three bits of its argument. Complete dbg_read_rx_misc names bits 12:20 and 28:31; complete dbg_read_bsr_info names bits 26:27. Complete hal_he_init and later HE OMC handling independently update UL-MU disable bits 30:31.</description>
          <addressOffset>0xC60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEFAULT_PE_DURATION</name>
              <description>Three-bit Default Packet Extension duration copied from HE Operation Parameters byte zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MPDU_LENGTH_OFFSET</name>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HE_USE_SOFTWARE_TXOP</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NFRP_BUFFER_THRESHOLD</name>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MIDDLE_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TX_ACK_ENABLED_AMPDU_ENABLE</name>
              <description>Complete dbg_read_bsr_info names bit 26 TX_ACK_ENABLED_AMPDU_EN.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSR_UPDATE_ENABLE</name>
              <description>Complete hal_he_bsr_init sets bit 27 through a separate fresh-read RMW; complete dbg_read_bsr_info names it BSR_UPDATE_EN.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB_STOP_OPTION</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HE_TRS_SUPPORT</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UL_MU_DATA_DISABLE</name>
              <description>HE Operating Mode Control UL MU Data Disable copied from HT-Control bit 17 by wifi_htc_omc_txcb.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UL_MU_DISABLE</name>
              <description>HE Operating Mode Control UL MU Disable copied from HT-Control bit 11 by wifi_htc_omc_txcb.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UORA_CONTROL</name>
          <description>Complete hal_he_set_uora_parameter with byte 0x2b writes 0x07 into bits 31:25 then 0x1f into bits 24:18.</description>
          <addressOffset>0xC64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HIGH_WINDOW</name>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOW_WINDOW</name>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEATURE_EDGES</name>
          <description>Parent sets bit one then bit zero through separate fresh-read RMWs.</description>
          <addressOffset>0xC68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE_1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_ENABLE_CONTROL</name>
          <description>Parent sets bit 31.</description>
          <addressOffset>0xCA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE_UNKNOWN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
