ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>QOS_NULL_TRANSLATION_CONTROL%s</name>
          <description>Three control words updated in address order by complete hal_he_set_hw_qos_null_ra_to_trans. The public leaf sets or clears bit two in every word; the hardware identities of the three profiles remain unknown.</description>
          <addressOffset>0xCA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>QOS_NULL_RA_TO_TRANSLATED_BSS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>QUEUE_CONTROL%s</name>
          <description>Canonical WDEVTXQ_CONF1. Eight physical queue words are addressed in reverse logical order: physical array index seven is logical queue zero. Complete multi-BSSID clear independently clears bit two. Complete blob and ROM mac_tx_set_tb construct the logical-queue-zero-through-three word from only the preserved bit two, TB_ENA, logical queue as MU-EDCA selection, first MPDU-link index and frame TID; all other bits are cleared. The legacy PPDU formatter clears bit 3 of physical entries four through seven, which is the same TB_ENA field rather than an independent PPDU-control register. An open ordinary-SU HE pre-port baseline read all eight logical queues with TB_ENA=0 and the decoded TID, MU-EDCA selection, MPDU-length-link and minimum-power fields zero; Trigger/TB hardware counters also remained zero.</description>
          <addressOffset>0xCD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_CLEARED_BY_TB_SETUP</name>
              <description>Bits zero and one are cleared by complete mac_tx_set_tb.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>QOS_NULL_TO_TRANSLATED_BSS</name>
              <description>The sole pre-existing bit preserved by complete mac_tx_set_tb.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_ENABLE</name>
              <description>Complete dbg_read_txq_conf1 names bit 3 TB_ENA; complete mac_tx_set_tb sets it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MU_EDCA_TIMER_SELECT</name>
              <description>Complete mac_tx_set_tb copies the two-bit logical queue number here.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MPDU_LENGTH_LINK_ADDRESS</name>
              <description>First seven-bit link returned by complete mac_tx_set_mplen.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TID</name>
              <description>Low four bits of the QoS descriptor state selected by complete mac_tx_set_tb.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINIMUM_TX_POWER</name>
              <description>Cleared by complete mac_tx_set_tb; the earlier debug decoder supplies the field name.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>HIGH_CLEARED_BY_TB_SETUP</name>
              <description>Bits 31:22 are cleared by complete mac_tx_set_tb.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>120</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-119</dimIndex>
          <name>HE_SCRATCH%s</name>
          <description>Parent clears 120 consecutive words from 0x201055f0 through 0x201057cc. Complete dbg_read_tx_mplen reads the same aperture as the hardware TX MPDU-length link table and names bits 13:0 MPDU_LEN and bits 20:14 NEXT. Complete mac_tx_set_mplen preserves bits 31:21, writes the fourteen-bit DMA metadata length (plus four when metadata word one bit 28 is set), and links contiguous allocated entries; the terminal entry uses NEXT=0x7f.</description>
          <addressOffset>0x15D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPDU_LENGTH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEXT_LINK</name>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
