ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_ANTENNA_INIT</name>
      <description>Complete hal_attenna_init transaction. The misspelled vendor symbol first visits eight reverse-stride queue/vector words, then updates one common word.</description>
      <baseAddress>0x201042B0</baseAddress>
      <registers>
        <register>
          <name>COMMON_CONTROL</name>
          <description>Complete leaf clears bit 2, then sets bit 5 through a separate fresh-read RMW.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMMON_CLEAR_UNKNOWN</name>
              <description>Cleared by the penultimate RMW of the complete leaf.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMMON_ENABLE_UNKNOWN</name>
              <description>Set by the final RMW of the complete leaf.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x7C</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>BANK_CONTROL%s</name>
          <description>Lower four unique words of the eight-word antenna traversal, at 0x201051ac..0x20105320. The upper four words are the canonical WIFI_MAC_TX_QUEUE_VECTOR.LENGTH_CONTROL array, whose decoded antenna fields occupy the same bits.</description>
          <addressOffset>0xEFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FIRST_CLEAR_UNKNOWN</name>
              <description>Cleared for all eight words in the first reverse traversal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECOND_CLEAR_UNKNOWN</name>
              <description>Cleared in the first RMW of each word in the second reverse traversal.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THIRD_CLEAR_UNKNOWN</name>
              <description>Cleared in the third RMW of each word in the second reverse traversal.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BANK_ENABLE_UNKNOWN</name>
              <description>Set in the middle RMW of each word in the second reverse traversal.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TSF_STATUS</name>
      <description>Station TSF activity status recovered from the complete no-call hal_is_sta_tsf_active leaf. The instruction body proves the address and bit geometry but not the hardware transition rules.</description>
      <baseAddress>0x2010D80C</baseAddress>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Complete hal_is_sta_tsf_active returns bit zero.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATION_ACTIVE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_SIGNAL_CLEAR</name>
          <description>Complete pm_clear_wakeup_signal sets bit zero before invoking two externally supplied synchronization callbacks; hardware clear behavior remains unknown.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TBTT_TARGET</name>
      <description>Station TBTT target word recovered from complete hal_set_sta_tbtt. The low 26-bit packing from the supplied 64-bit TSF value is exact; the hardware counter unit remains unnamed.</description>
      <baseAddress>0x2010D82C</baseAddress>
      <registers>
        <register>
          <name>TARGET</name>
          <description>Complete hal_set_sta_tbtt replaces bits 25:0 with bits 35:10 of the supplied station TSF value and preserves the high six bits.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSF_BITS_35_10</name>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TSF_LOAD</name>
      <description>Shared station TSF load and coherent snapshot transaction.</description>
      <baseAddress>0x2010D814</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Complete hal_set_sta_tsf asserts bit four after writing both station TSF value words; the SoftAP path of complete hal_mac_tsf_reset asserts bit five after clearing both shared TSF value words; complete hal_get_sta_tsf sets then clears bit zero around its snapshot reads.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SNAPSHOT_STATION_TSF</name>
              <description>Complete hal_get_sta_tsf sets this bit before either station TSF word is sampled and clears it after the optional reads.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOAD_STATION_TSF</name>
              <description>Station TSF load request asserted by the final fresh-read RMW in hal_set_sta_tsf.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOAD_SOFTAP_TSF</name>
              <description>SoftAP TSF load request asserted after the two zero-value writes by the arg0=0 path of complete hal_mac_tsf_reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_LOW</name>
          <description>Low 32 bits written first by complete hal_set_sta_tsf.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_HIGH</name>
          <description>High 32 bits written second by complete hal_set_sta_tsf.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SNAPSHOT_LOW</name>
          <description>Coherently latched low 32 bits conditionally read by complete hal_get_sta_tsf.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SNAPSHOT_HIGH</name>
          <description>Coherently latched high 32 bits conditionally read by complete hal_get_sta_tsf.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSF_DEVIATION_CONTROL</name>
          <description>Complete ROM leaves independently replace the TSF deviation value and set two synchronization controls; omitted bits remain semantically unknown.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEVIATION</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RX_BEACON_ABORT_SYNC_ENABLE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEVIATION_SYNC_ENABLE</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
