ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RTC_TIMER_UPDATE</name>
      <description>Complete enabled path of hal_timer_update_by_rtc, reached from complete hal_init with enable one and the OS-adapter slow-clock calibration value.</description>
      <baseAddress>0x2010D830</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Enabled hal_timer_update_by_rtc sets bit 27. hal_set_sta_tsf_wakeup sets or clears bit 21 together with the STA TSF wakeup bit at 0x2010d858.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STA_TSF_WAKEUP_ENABLE</name>
              <description>hal_set_sta_tsf_wakeup sets or clears this bit in the same branch as STA_TSF_CONTROL.STA_TSF_WAKEUP_ENABLE.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC_UPDATE_ENABLE_UNKNOWN</name>
              <description>Set when the leaf's enable argument is nonzero.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_WAKEUP_CLEAR</name>
          <description>Complete hal_tsf_clear_soc_wakeup_request sets bit 30. Complete modem-power leaves independently expose status bits and clear pulses in this shared word; hardware transition behavior is not inferred.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BEACON_FILTER_FORCE_SYNC_LIMIT</name>
              <description>The dedicated setter replaces bits 9:0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>BEACON_FILTER_FORCE_SYNC_ENABLE</name>
              <description>Dedicated enable/disable leaves set or clear bit 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BEACON_FILTER_FORCE_DUMP_LIMIT</name>
              <description>The dedicated setter replaces bits 17:11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>BEACON_FILTER_FORCE_DUMP_ENABLE</name>
              <description>Dedicated enable/disable leaves set or clear bit 21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAR_BEACON_SLEEP_COUNTER</name>
              <description>Dedicated clear leaf sets bit 28.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAR_BEACON_MISS_COUNTER</name>
              <description>Dedicated clear leaf sets bit 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAR_REQUEST</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAR_BEACON_INFO</name>
              <description>Dedicated clear leaf sets bit 31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_SLEEP_LIMIT_CONTROL</name>
          <description>Complete no-call setters prove two bounded modem counters and their independent limit-exceeded wake gates. Units and hardware transition behavior remain unknown.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BEACON_MISS_LIMIT</name>
              <description>Low four argument bits published by pwr_hal_set_mac_modem_beacon_miss_limit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BEACON_MISS_LIMIT_WAKEUP_ENABLE</name>
              <description>Dedicated enable/disable leaves set or clear bit four.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODEM_STATE_SLEEP_LIMIT</name>
              <description>Low ten argument bits published in bits 14:5 by pwr_hal_set_mac_modem_state_sleep_limit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODEM_STATE_SLEEP_LIMIT_WAKEUP_ENABLE</name>
              <description>Dedicated enable/disable leaves set or clear bit fifteen.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STA_LIGHT_SLEEP_WAKE_AHEAD</name>
          <description>Complete hal_set_sta_light_sleep_wake_ahead_time replaces the high sixteen bits. Complete hal_set_sta_tbtt independently publishes its fifth argument to the same field.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIME</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBTT_RF_CONTROL_WAIT_CYCLES</name>
          <description>Complete tsf_hal_set_tbtt_rf_ctrl_wait_cycles replaces the low twenty-four bits; units and hardware transition behavior remain unknown.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WAIT_CYCLES</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BEACON_TIME_LOW</name>
          <description>Complete hal_set_rx_beacon_time and pwr_hal_set_mac_modem_beacon_miss_timeout independently replace the same low sixteen bits. The mode-dependent hardware interpretation is not inferred.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STA_TSF_CONTROL</name>
          <description>Shared STA TSF scheduler and modem-state wakeup control word used by hal_enable_sta_tsf, hal_disable_sta_tsf, hal_set_sta_tsf_wakeup, and the wakeup-protect enable/disable leaves.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STA_TSF_MODE</name>
              <description>hal_enable_sta_tsf replaces bits 22:19 with one; hal_disable_sta_tsf clears them.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>StaTsfMode</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODEM_STATE_WAKEUP_PROTECT_ENABLE</name>
              <description>pwr_hal_set_mac_modem_state_wakeup_protect_enable sets this bit and the corresponding disable leaf clears it.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STA_TSF_ENABLE_LOW</name>
              <description>hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STA_TSF_WAKEUP_ENABLE</name>
              <description>hal_set_sta_tsf_wakeup sets or clears this bit together with WIFI_MAC_RTC_TIMER_UPDATE.CONTROL.STA_TSF_WAKEUP_ENABLE.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STA_TSF_ENABLE_HIGH</name>
              <description>hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STA_TBTT_INTERVAL</name>
          <description>Complete hal_set_sta_tbtt_interval replaces the low 22 bits from argument bits 31:10. Complete hal_set_sta_tbtt performs the same update from its third argument.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTERVAL_BITS_31_10</name>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOW_CLOCK_CALIBRATION</name>
          <description>Enabled hal_timer_update_by_rtc replaces bits 17:0 with the low eighteen bits returned by g_wifi_osi_funcs._slowclk_cal_get.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Any eighteen-bit value returned by the OS-adapter calibration callback is published without interpretation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>262143</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
