ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TXRX_SUFFIX</name>
      <description>Eight Wi-Fi-owned direct fresh-read RMW edges after the three external HE callbacks in complete mac_txrx_init. The ninth edge reaches the independently shared physical word at 0x20104C24 and is modeled by SHARED_RADIO_INIT_CONTROL.</description>
      <baseAddress>0x20104308</baseAddress>
      <registers>
        <register>
          <name>AUX_ENABLE</name>
          <description>The TX/RX init suffix sets bit 1. Complete dbg_clr_hw_count reaches esp_test_clr_hw_statistics, which independently pulses bit 0 high then low while the matching core statistics-clear arm is asserted.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDWARE_STATISTICS_CLEAR_PULSE</name>
              <description>Set and then cleared by complete esp_test_clr_hw_statistics.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE_UNKNOWN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_IMAGE_A</name>
          <description>Complete suffix replaces the low twelve bits with 0x0f0.</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_IMAGE_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GATE_CONTROL</name>
          <description>Complete suffix sets bits 30:16 together, then sets bit 31 through a separate fresh-read edge.</description>
          <addressOffset>0x958</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_GATE_GROUP_UNKNOWN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>32767</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGH_GATE_UNKNOWN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIELD_CONTROL</name>
          <description>Complete suffix replaces bits 7:4 with four.</description>
          <addressOffset>0x9A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FIELD_UNKNOWN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SHARED_RADIO_INIT_CONTROL</name>
      <description>One physical radio word independently reached by Wi-Fi MAC initialization and Bluetooth receive setup. The owner is protocol-neutral because the two consumers update disjoint fields through fresh-read RMW operations; the name records the observed setup context without assigning an undocumented electrical meaning.</description>
      <baseAddress>0x20104C24</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Complete mac_txrx_init replaces the low twelve bits with 0x0F0. Complete bt_bb_rx_set independently clears bit 31. Bits 30:12 remain unnamed.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIFI_INIT_LOW_IMAGE_UNKNOWN</name>
              <description>Complete mac_txrx_init replaces this field with the finite image 0x0F0 while preserving bits 31:12.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BT_RX_SETUP_BIT_31_UNKNOWN</name>
              <description>Complete bt_bb_rx_set clears this bit through a fresh-read RMW while preserving bits 30:0. Its hardware meaning remains unknown.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_CSI_CONTROL</name>
      <description>Multifunction receive/CSI word. Complete mac_last_rxbuf_init sets bit 27; complete hal_init later replaces its low and second bytes through separate RMWs.</description>
      <baseAddress>0x20104098</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Complete mac_last_rxbuf_init sets bit 27 after publishing all six table entries and both control groups. Complete hal_init later replaces byte zero with one, then byte one with one through a second fresh-read edge.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HAL_INIT_LOW_BYTE_UNKNOWN</name>
              <description>Complete hal_init replaces bits 7:0 with one.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>INITIALIZED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAL_INIT_SECOND_BYTE_UNKNOWN</name>
              <description>Complete hal_init replaces bits 15:8 with one through a separate RMW.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>INITIALIZED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_RX_BUFFER_ENABLE_UNKNOWN</name>
              <description>Final set edge of mac_last_rxbuf_init; its narrower interaction with CSI is unknown.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
