ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_INTERRUPT</name>
      <description>Wi-Fi MAC interrupt mask, masked status and write-to-clear aperture.
        The two complete hal_mac leaves independently prove the status and
        clear addresses. The recovered common FIQ and cold initializer prove
        the event-bit mapping and mask transaction used by the open ISR.</description>
      <baseAddress>0x20104C40</baseAddress>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Complete hal_init first publishes 0x19a879e0 here before its remaining tail. Complete hal_enable_mac independently publishes its argument after clearing the shared MAC disable gates. The common FIQ samples it with each interrupt status snapshot.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNKNOWN_0_4</name>
              <description>Interrupt-enable bits whose event identities remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>RX_ASSOCIATED_AUXILIARY_5</name>
              <description>Enable for the status bit observed together with RX_SUCCESS during sustained receive traffic.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_6_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_COMPLETE</name>
              <description>Enable for the TX-complete event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSS_COLOR_COLLISION</name>
              <description>Enable for the HE BSS-color collision event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_9_10</name>
              <description>Interrupt-enable bits whose event identities remain unknown.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WATCHDOG</name>
              <description>Enable for the MAC watchdog event.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_12_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_13_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SUCCESS</name>
              <description>Enable for successful receive completion.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STA_BEACON_FILTER</name>
              <description>Enable for the station beacon-filter event; the complete disable leaf clears this bit after disabling the filter hardware.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_16_18</name>
              <description>Interrupt-enable bits whose event identities remain unknown.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TX_TIMEOUT</name>
              <description>Enable for the hardware TX queue timeout/abort event.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_20</name>
              <description>Interrupt-enable bit whose event identity remains unknown.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_21_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_22</name>
              <description>Interrupt-enable bit whose event identity remains unknown.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_23_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ASSOCIATED_AUXILIARY_24</name>
              <description>Enable for the status bit observed together with RX_SUCCESS during sustained receive traffic.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_25_26</name>
              <description>Interrupt-enable bits whose event identities remain unknown.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_27_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_28_UNKNOWN</name>
              <description>Unknown event enabled by the complete cold receive mask.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_29_31</name>
              <description>Interrupt-enable bits whose event identities remain unknown.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW</name>
          <description>Unmasked WDEV interrupt snapshot read by print_isr_regs. Complete hal_disable_mac writes zero after masking ENABLE.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Masked MAC event snapshot read by the complete hal_mac_interrupt_get_event leaf. Its bit geometry matches the complete ENABLE event bank; only independently recovered event identities are named semantically.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>UNKNOWN_0_4</name>
              <description>Masked event bits whose identities remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>RX_ASSOCIATED_AUXILIARY_5</name>
              <description>Enabled by the cold MAC mask 0x19a879e0 and observed asserted with RX_SUCCESS throughout sustained HE20 receive traffic. Complete wDev_ProcessFiq acknowledges this bit as part of the full STATUS image but does not dispatch independent work for it. Its hardware meaning and independent transition rules remain unknown; software must not treat it as RX ownership or work multiplicity.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_6_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_COMPLETE</name>
              <description>At least one hardware TX queue completed.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSS_COLOR_COLLISION</name>
              <description>HE BSS-color collision event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_9_10</name>
              <description>Masked event bits whose identities remain unknown.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WATCHDOG</name>
              <description>MAC watchdog event cleared by the complete dedicated leaf.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_12_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_13_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SUCCESS</name>
              <description>Successfully received frame is ready for the RX completion path.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STA_BEACON_FILTER</name>
              <description>Masked station beacon-filter event. The paired ENABLE field identity is recovered from the complete disable leaf; no task-side dispatch is claimed here.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_16_18</name>
              <description>Masked event bits whose identities remain unknown.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TX_TIMEOUT</name>
              <description>Hardware TX queue timeout/abort event.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_20</name>
              <description>Masked event bit whose identity remains unknown.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_21_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_22</name>
              <description>Masked event bit whose identity remains unknown.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_23_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ASSOCIATED_AUXILIARY_24</name>
              <description>Enabled by the cold MAC mask 0x19a879e0 and observed asserted with RX_SUCCESS throughout sustained HE20 receive traffic. Complete wDev_ProcessFiq acknowledges this bit as part of the full STATUS image but does not dispatch independent work for it. Its hardware meaning and independent transition rules remain unknown; software must not treat it as RX ownership or work multiplicity.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_25_26</name>
              <description>Masked event bits whose identities remain unknown.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_27_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLD_RX_ENABLE_28_UNKNOWN</name>
              <description>Masked event bit enabled by the complete cold receive mask; its event identity remains unknown.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN_29_31</name>
              <description>Masked event bits whose identities remain unknown.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEAR</name>
          <description>Full event snapshot written by the complete clear leaf to acknowledge pending MAC events.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>EVENTS</name>
              <description>Ones acknowledge the corresponding event bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
