ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_COLD_HANDSHAKE</name>
      <description>Cold MAC initialization request/ready handshake and the adjacent two WDEV timer targets recovered from complete ROM leaves.</description>
      <baseAddress>0x20104DE0</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Software sets REQUEST with a fresh-read RMW, then polls READY before touching the remaining MAC state.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Polled until asserted after REQUEST.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REQUEST</name>
              <description>Set before the READY polling loop.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNKNOWN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDEV_TIMER_TARGET_0_CONTROL</name>
          <description>hal_wdev_timer_target_enable selects timer zero with argument zero and replaces enable bit zero.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDEV_TIMER_TARGET_0_VALUE</name>
          <description>hal_wdev_timer_set_target selects timer zero with argument zero and writes the supplied 32-bit target.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDEV_TIMER_TARGET_1_CONTROL</name>
          <description>hal_wdev_timer_target_enable selects timer one with argument one and replaces enable bit zero.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDEV_TIMER_TARGET_1_VALUE</name>
          <description>hal_wdev_timer_set_target selects timer one with argument one and writes the supplied 32-bit target.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_DMA</name>
      <description>Descriptor-walker registers
        recovered from complete rev0 ROM leaves and qualified with the open
        driver's rotating 32-entry RX ring.</description>
      <baseAddress>0x20104000</baseAddress>
      <registers>
        <register>
          <name>RX_COLD_CONTROL_UNKNOWN</name>
          <description>Complete mac_rxbuf_init clears the low byte immediately before publishing the descriptor base. Individual bit meanings are unknown.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COLD_LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONTROL</name>
          <description>RX descriptor-walker gate, hardware-beacon reload selection and live-list append doorbell.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APPEND_DESCRIPTOR_RELOAD</name>
              <description>Write one after publishing old_tail.next to make a prepared live-list append visible. Hardware clears the bit after accepting the append.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>WALKER_ENABLE</name>
              <description>Set by hal_mac_rx_enable and cleared by hal_mac_rx_disable; gates the RX descriptor walker.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HARDWARE_BEACON_RELOAD_UNKNOWN</name>
              <description>Complete hal_mac_set_rxbuf_reload_use_hw_beacon_enable sets bit 27 through one fresh-read RMW.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DESCRIPTOR_BASE</name>
          <description>Complete first-descriptor address. The ROM and blob leaves publish the unmasked 32-bit pointer when installing a cold or repaired frontier; the selected high-address window separately completes the hardware last/next descriptor observations.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_NEXT_DESCRIPTOR</name>
          <description>Complete hardware current/next descriptor word. The low 20 bits are the reviewed address projection; meanings of bits 31:20 remain unknown. Complete ROM wDev_AppendRxBlocks compares the entire 32-bit word with zero after reload completion, not only ADDRESS_LOW, before it may read LAST and repair RX_DESCRIPTOR_BASE.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_LOW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>UPPER_UNKNOWN</name>
              <description>Unassigned upper state retained by the complete-word zero predicate in wDev_AppendRxBlocks. This is deliberately exposed separately from ADDRESS_LOW so production code never reconstructs or masks a register image.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LAST_DESCRIPTOR</name>
          <description>Low 20 bits of the last descriptor accepted by the RX walker.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_LOW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_DUMP_CONFIG</name>
          <description>Complete esp_test_get_csi_dump_cfg reads every described field at 0x2010411c. Complete esp_test_set_csi_dump_cfg performs independent fresh-read RMW updates. Its BEAMFORMED update has a pinned vendor quirk: cfg[8] controls whether bit 11 is updated, but cfg[1] (MU) supplies the value. This SVD exposes the physical bit and does not reproduce that software bug.</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_LLTF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MU</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SU</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VHT</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HT40</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HT20</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEGACY</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBC_MODE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BEAMFORMED</name>
              <description>Physical CSI-dump beamformed selector. The pinned vendor setter accidentally writes the MU argument when this field is selected; callers of the generated PAC write the actual bit directly.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STANDALONE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCM</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BUFFER_LIMIT_UNKNOWN</name>
          <description>Complete mac_rxbuf_init sets the low twenty bits before descriptor publication.</description>
          <addressOffset>0xC68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BUFFER_BASE_UNKNOWN</name>
          <description>Complete mac_rxbuf_init replaces the low twenty bits with four before selecting the descriptor high window.</description>
          <addressOffset>0xC6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DESCRIPTOR_HIGH_WINDOW</name>
          <description>High 12 descriptor-address bits shared with the low-address RX pointer registers. Complete mac_rxbuf_init and the open driver program 0x2f0 for internal SRAM.</description>
          <addressOffset>0xC70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS_HIGH</name>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q7</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 7.</description>
          <addressOffset>0x11C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q7</name>
          <description>WDEVTXQBA_BMHI for reverse-addressed hardware queue 7.</description>
          <addressOffset>0x11C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q7</name>
          <description>WDEVTXQBA_BMLO for reverse-addressed hardware queue 7.</description>
          <addressOffset>0x11C8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q7</name>
          <description>WDEVTXQBA_SSN: starting sequence bits 15:4 and TID/control bits 19:16 for queue 7.</description>
          <addressOffset>0x11CC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q7</name>
          <description>WDEVTXQBA_TAHI; the blob identifies the low sixteen bits as the high two transmitter-address bytes and the upper fields as ACK/BlockAck result state.</description>
          <addressOffset>0x11D0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q7</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x11D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q6</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 6.</description>
          <addressOffset>0x123C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q6</name>
          <description>WDEVTXQBA_BMHI for reverse-addressed hardware queue 6.</description>
          <addressOffset>0x1240</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q6</name>
          <description>WDEVTXQBA_BMLO for reverse-addressed hardware queue 6.</description>
          <addressOffset>0x1244</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q6</name>
          <description>WDEVTXQBA_SSN: starting sequence bits 15:4 and TID/control bits 19:16 for queue 6.</description>
          <addressOffset>0x1248</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q6</name>
          <description>WDEVTXQBA_TAHI; the blob identifies the low sixteen bits as the high two transmitter-address bytes and the upper fields as ACK/BlockAck result state.</description>
          <addressOffset>0x124C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q6</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x1250</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q5</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 5.</description>
          <addressOffset>0x12B8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q5</name>
          <description>WDEVTXQBA_BMHI for reverse-addressed hardware queue 5.</description>
          <addressOffset>0x12BC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q5</name>
          <description>WDEVTXQBA_BMLO for reverse-addressed hardware queue 5.</description>
          <addressOffset>0x12C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
