ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q5</name>
          <description>WDEVTXQBA_SSN: starting sequence bits 15:4 and TID/control bits 19:16 for queue 5.</description>
          <addressOffset>0x12C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q5</name>
          <description>WDEVTXQBA_TAHI; the blob identifies the low sixteen bits as the high two transmitter-address bytes and the upper fields as ACK/BlockAck result state.</description>
          <addressOffset>0x12C8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q5</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x12CC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q4</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 4.</description>
          <addressOffset>0x1334</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q4</name>
          <description>WDEVTXQBA_BMHI for reverse-addressed hardware queue 4.</description>
          <addressOffset>0x1338</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q4</name>
          <description>WDEVTXQBA_BMLO for reverse-addressed hardware queue 4.</description>
          <addressOffset>0x133C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q4</name>
          <description>WDEVTXQBA_SSN: starting sequence bits 15:4 and TID/control bits 19:16 for queue 4.</description>
          <addressOffset>0x1340</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q4</name>
          <description>WDEVTXQBA_TAHI; the blob identifies the low sixteen bits as the high two transmitter-address bytes and the upper fields as ACK/BlockAck result state.</description>
          <addressOffset>0x1344</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q4</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x1348</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q3</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 3.</description>
          <addressOffset>0x13B0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q3</name>
          <description>High 32 acknowledgement bits for completed hardware queue 3.</description>
          <addressOffset>0x13B4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q3</name>
          <description>Low 32 acknowledgement bits for completed hardware queue 3.</description>
          <addressOffset>0x13B8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q3</name>
          <description>Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 3.</description>
          <addressOffset>0x13BC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q3</name>
          <description>WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x13C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q3</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x13C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q2</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 2.</description>
          <addressOffset>0x142C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q2</name>
          <description>High 32 acknowledgement bits for completed hardware queue 2.</description>
          <addressOffset>0x1430</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q2</name>
          <description>Low 32 acknowledgement bits for completed hardware queue 2.</description>
          <addressOffset>0x1434</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q2</name>
          <description>Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 2.</description>
          <addressOffset>0x1438</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q2</name>
          <description>WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x143C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q2</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x1440</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q1</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 1.</description>
          <addressOffset>0x14A8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q1</name>
          <description>High 32 acknowledgement bits for completed hardware queue 1.</description>
          <addressOffset>0x14AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q1</name>
          <description>Low 32 acknowledgement bits for completed hardware queue 1.</description>
          <addressOffset>0x14B0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q1</name>
          <description>Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 1.</description>
          <addressOffset>0x14B4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q1</name>
          <description>WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x14B8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q1</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x14BC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q0</name>
          <description>WDEVTXQ_TXINFO for reverse-addressed hardware queue 0.</description>
          <addressOffset>0x1524</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TRIGGER_BASED_PACKET_COUNT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>LAST_TX_WAS_TRIGGER_BASED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q0</name>
          <description>High 32 acknowledgement bits for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x1528</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q0</name>
          <description>Low 32 acknowledgement bits for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x152C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q0</name>
          <description>Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x1530</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STARTING_SEQUENCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TID_OR_CONTROL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q0</name>
          <description>WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state for completed queue 0.</description>
          <addressOffset>0x1534</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_4_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ACK_TID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACK_RECEIVED</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLOCK_ACK_RECEIVED</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
