ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q0</name>
          <description>WDEVTXQBA_TALO; low four transmitter-address bytes for completed queue 0.</description>
          <addressOffset>0x1538</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRESS_BYTES_0_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_CONTROL</name>
          <description>Configuration word in one of eight reverse-addressed ordinary receive BlockAck banks. Physical array index zero is logical hardware index seven; complete hal_agreement_add_rx_ba writes logical index zero at 0x20104274 and subtracts 0x24 per index. Delete clears VALID, clears both load bitmaps, sets VALID once, then clears this complete word.</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Complete add sets this bit in every installed ordinary receive BlockAck entry.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_UNKNOWN_1_11</name>
              <description>Bits preserved by reads but cleared by every reviewed zero-based ordinary-entry publication.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>TID</name>
              <description>Traffic identifier passed to complete hal_agreement_add_rx_ba without the extra staging path's index transform. The field is four bits wide, while complete ht_recv_action_ba_addba_request rejects values with bit three set and therefore admits TIDs zero through seven.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONTROL_UNKNOWN_16_29</name>
              <description>Bits preserved by reads but cleared by every reviewed zero-based ordinary-entry publication.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>WRITE</name>
              <description>Complete add sets this bit together with ENABLE and VALID when publishing the entry configuration.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID</name>
              <description>Marks an installed entry. Complete delete clears and reasserts it around bitmap clearing before zeroing the entry.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_PEER_TAIL_AND_POLICY</name>
          <description>Peer MAC bytes four and five, interface number and receive reorder-window size in one reverse-addressed ordinary receive BlockAck bank. Complete vendor ampdu_rx_start limits the protocol agreement by the peer request and configured receive window; its ordinary hardware-activation branch independently passes the constant 64 to ic_add_rx_ba. Complete hal_agreement_add_rx_ba then stores that value in WINDOW.</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEER_ADDRESS_TAIL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTERFACE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Seven-bit hardware receive BlockAck window. The normal vendor ordinary-STA activation path publishes 64.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POLICY_UNKNOWN_25_31</name>
              <description>Bits cleared by every reviewed zero-based ordinary-entry policy publication.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_PEER_HEAD</name>
          <description>Peer MAC bytes zero through three in little-endian order in one reverse-addressed ordinary receive BlockAck bank.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEER_ADDRESS_HEAD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_CURRENT_SEQUENCE</name>
          <description>Hardware-maintained twelve-bit receive/reorder sequence state. Complete hal_ba_session_store snapshots this word and complete hal_ba_session_restore copies its saved low twelve bits into START_SEQUENCE_LOAD.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEQUENCE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_START_SEQUENCE_LOAD</name>
          <description>Twelve-bit starting sequence written by complete add/reset/restore leaves. This is the software load word paired with the adjacent hardware-maintained CURRENT_SEQUENCE word.</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQUENCE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_LOW_STATUS</name>
          <description>Hardware-maintained low reorder bitmap. Complete hal_ba_session_store snapshots this word and restore copies it into BITMAP_LOW_LOAD while VALID is clear.</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>Low 32 bits of the hardware-maintained receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_LOW_LOAD</name>
          <description>Software load word for the low reorder bitmap. Complete add and delete clear it; complete session restore writes the saved low status bitmap here while VALID is clear.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>Low 32 bits of the software-loaded receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_HIGH_STATUS</name>
          <description>Hardware-maintained high reorder bitmap. Complete hal_ba_session_store snapshots this word and restore copies it into BITMAP_HIGH_LOAD while VALID is clear.</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>High 32 bits of the hardware-maintained receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_HIGH_LOAD</name>
          <description>Software load word for the high reorder bitmap. Complete add and delete clear it; complete session restore writes the saved high status bitmap here while VALID is clear.</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>High 32 bits of the software-loaded receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BLOCK_ACK_AGREEMENT_UPDATE</name>
          <description>Ordinary add/reset sets one of bits zero through seven for the corresponding direct bank. The independent extra-SoftAP staging path pulses bit eight to commit and uses bit nine to latch a selected entry for readback.</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ORDINARY_ENTRY_UPDATE</name>
              <description>One update bit per reverse-addressed ordinary receive BlockAck bank. Complete add/reset performs a fresh-read OR with one shifted by the logical hardware index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EXTRA_SOFTAP_COMMIT</name>
              <description>Complete extra-SoftAP add/reset/delete pulses this bit high then low after filling the shared staging words.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTRA_SOFTAP_READBACK_LATCH</name>
              <description>Complete extra-SoftAP diagnostics, reset and delete set this bit while reading the entry selected in the staging control and clear it afterwards.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_CONTROL</name>
          <description>Shared staging and readback-control word used only by complete hal_agreement_*_extra_softap_rx_ba leaves. Ordinary STA/AP receive BlockAck agreements use the eight direct banks at 0x20104178..0x20104294 instead.</description>
          <addressOffset>0xEA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_UNKNOWN_1_4</name>
              <description>Bits cleared by every reviewed zero-based extra-SoftAP control publication.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INDEX</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONTROL_UNKNOWN_10_11</name>
              <description>Bits cleared by every reviewed zero-based extra-SoftAP control publication.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TID</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONTROL_UNKNOWN_16_29</name>
              <description>Bits cleared by every reviewed zero-based extra-SoftAP control publication.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>WRITE</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_PEER_TAIL_AND_POLICY</name>
          <description>Shared extra-SoftAP staging word carrying peer MAC bytes four and five, interface and reorder-window size.</description>
          <addressOffset>0xEA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEER_ADDRESS_TAIL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTERFACE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WINDOW</name>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POLICY_UNKNOWN_25_31</name>
              <description>Bits cleared by every reviewed zero-based extra-SoftAP policy publication.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_PEER_HEAD</name>
          <description>Shared extra-SoftAP staging word carrying peer MAC bytes zero through three in little-endian order.</description>
          <addressOffset>0xEAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEER_ADDRESS_HEAD</name>
              <description>Peer MAC address bytes zero through three in little-endian order.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_START_SEQUENCE</name>
          <description>Shared extra-SoftAP staging word carrying the twelve-bit starting sequence.</description>
          <addressOffset>0xEB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQUENCE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_LOW</name>
          <description>Shared extra-SoftAP low receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0xEB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>Low 32 bits of the selected extra-SoftAP receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_HIGH</name>
          <description>Shared extra-SoftAP high receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0xEB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITMAP</name>
              <description>High 32 bits of the selected extra-SoftAP receive reorder bitmap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
