ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FECOEX_RECOVERED</name>
      <description>Sparse FECOEX words absent from the public platform PAC.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>BT_COEX_PTI_CONFIG</name>
          <description>Complete coex_pti_v2 performs two ordered fresh-read RMW operations: it first replaces bits 31:16 with 0x0640, then replaces bits 15:0 with 0x0010. Individual bit meanings remain unknown.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_IMAGE_UNKNOWN</name>
              <description>Fixed 0x0010 image published by the second coex_pti_v2 RMW.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>LOW_IMAGE</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>REVIEWED_IMAGE</name>
                  <description>The only low-halfword image proved by coex_pti_v2.</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIGH_IMAGE_UNKNOWN</name>
              <description>Fixed 0x0640 image published by the first coex_pti_v2 RMW.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>HIGH_IMAGE</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>REVIEWED_IMAGE</name>
                  <description>The only high-halfword image proved by coex_pti_v2.</description>
                  <value>1600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FEDATA_RECOVERED</name>
      <description>Sparse FEDATA words absent from the public platform PAC.</description>
      <baseAddress>0x20100400</baseAddress>
      <registers>
        <register>
          <name>RX_FILTER_MODE_OPAQUE</name>
          <description>Complete phy_rx_filter_mode performs a read-modify-write; individual fields remain unnamed.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TX_RX_RESET_OPAQUE</name>
          <description>Complete phy_fe_txrx_reset performs a read-modify-write; individual fields remain unnamed.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_RX_RESET_LOW_OPAQUE</name>
              <description>Thirteen-bit low reset group cleared by complete phy_fe_txrx_reset.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TX_RX_RESET_BIT_25</name>
              <description>First upper reset bit asserted by complete phy_fe_txrx_reset.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_RX_RESET_BIT_26</name>
              <description>Second upper reset bit cleared and then asserted by complete phy_fe_txrx_reset.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FECTRL_RECOVERED</name>
      <description>Sparse FECTRL antenna words absent from the public platform PAC.</description>
      <baseAddress>0x20100800</baseAddress>
      <registers>
        <register>
          <name>ANTENNA_CONFIG_WORD_0_OPAQUE</name>
          <description>Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANTENNA_CONFIG_WORD_1_OPAQUE</name>
          <description>Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANTENNA_CONFIG_WORD_2_OPAQUE</name>
          <description>Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANTENNA_CONFIG_WORD_3_OPAQUE</name>
          <description>Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FEDATA_WIFI_RECOVERED</name>
      <description>Sparse FEDATA_WIFI words absent from the public platform PAC.</description>
      <baseAddress>0x20100C00</baseAddress>
      <registers>
        <register>
          <name>CFO_CONFIG_WORD_0_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg reads and replaces this word; individual hardware fields remain unnamed.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FREQUENCY_CORRECTION_WORD_0_OPAQUE</name>
          <description>Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FREQUENCY_CORRECTION_WORD_1_OPAQUE</name>
          <description>Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
