ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_BTAGC_RECOVERED</name>
      <description>Sparse BTAGC words absent from the public platform PAC.</description>
      <baseAddress>0x20102800</baseAddress>
      <registers>
        <register>
          <name>CTE_DC_SHIFT</name>
          <description>Bluetooth CTE DC-shift limit control; only the independently named three-bit maximum field is assigned.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DC_SHIFT_MAX</name>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_CONFIG_VALUE</name>
              <description>bt_bb_rx_set replaces this field with the finite value 7. No narrower hardware meaning is claimed.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTE_RE_GAIN</name>
          <description>Bluetooth CTE receive-gain control; the setter unconditionally sets the exposed enable bit.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RE_GAIN_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_GAIN_FORCE_OPAQUE</name>
          <description>Complete phy_rx_gain_force and bt_agc_target_set read-modify-write two disjoint positional fields in this word.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DYNAMIC_BITS_0_6</name>
              <description>bt_agc_gain_set replaces this field with the low seven bits of the byte read from the linked phy_param image at offset 0x120.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TARGET_BITS_13_21</name>
              <description>bt_agc_target_set replaces this positional field with the finite image 0x1d4.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAIN_OFFSET_WORD_0_OPAQUE</name>
          <description>Complete bt_set_rx_comp and bt_agc_gain_offset read-modify-write four positional fields; individual hardware meanings remain unnamed.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_BITS_0_4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_5_9</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_16_23</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_24_31</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONFIG_004C</name>
          <description>Bluetooth receive setup clears one independently observed control bit.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ZERO_26</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAIN_OFFSET_WORD_1_OPAQUE</name>
          <description>Complete bt_agc_gain_offset and bt_agc_recorrect_set read-modify-write seven positional fields; individual hardware meanings remain unnamed.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_BITS_0_4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSITIONAL_BITS_6_10</name>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_11_12</name>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_13</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSITIONAL_BITS_16_23</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_24_31</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_CONFIG</name>
          <description>Finite Bluetooth clear-channel-assessment defaults written by bt_bb_cca_config. Untouched fields remain unassigned.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_VALUE_0</name>
              <description>Nine-bit finite value 0x1CE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONFIG_VALUE_1</name>
              <description>Five-bit finite value 0x1E.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONFIG_FORCE_ONE_23</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TARGET_BITS_14_22</name>
              <description>bt_agc_target_set replaces this positional field with the finite image 0x1ce.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTE_AGC_TARGET</name>
          <description>Bluetooth CTE AGC target word; only the independently named nine-bit target field is assigned.</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AGC_TARGET_VALUE</name>
              <bitOffset>21</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>BASEBAND_TARGET_VALUE</name>
              <description>bt_agc_target_set replaces this disjoint low field with the finite image 0x1d4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONFIG_0088</name>
          <description>Bluetooth receive setup clears bit 29 and sets bit 18 through separate fresh-read operations.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ONE_18</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIG_FORCE_ZERO_29</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIG_FORCE_ZERO_30</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONFIG_008C</name>
          <description>Bluetooth receive setup and target configuration update three disjoint positional fields and clear one independently observed control bit.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ZERO_29</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TARGET_BITS_0_8</name>
              <description>bt_agc_target_set replaces this positional field with the finite image 0x1d4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TARGET_BITS_9_17</name>
              <description>bt_agc_target_set replaces this positional field with the finite image 0x1dc.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_CONFIG_00D0</name>
          <description>bt_agc_v2_set replaces two seven-bit fields with the finite value 20.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_VALUE_LOW</name>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONFIG_VALUE_HIGH</name>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_CONFIG_00D4</name>
          <description>bt_agc_v2_set replaces bits 24:6 with the finite image 0x003C0.</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_VALUE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>19</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>524287</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_COMP_CONTROL</name>
          <description>Complete bt_set_rx_comp updates five non-overlapping fields; the two low fields are dynamic and the three higher fields receive finite images.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DYNAMIC_BITS_0_6</name>
              <description>The leaf replaces this exact field with a dynamic image.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DYNAMIC_BITS_7_13</name>
              <description>The leaf replaces this exact field with a dynamic image.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FINITE_BITS_14_18</name>
              <description>The leaf replaces this field with 8.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FINITE_BITS_19_23</name>
              <description>The leaf replaces this field with 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FINITE_BITS_24_28</name>
              <description>The leaf replaces this field with 6.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_MAX_CONTROL</name>
          <description>Complete bt_agc_gain_max replaces bits 20:14 with one dynamic image while preserving all other bits.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DYNAMIC_BITS_14_20</name>
              <description>Exact dynamic image written by the complete leaf.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_IMAGE</name>
          <description>Complete bt_agc_gain_set replaces one seven-bit field derived from the linked phy_param byte at offset 0x120 and preserves every other bit.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DYNAMIC_BITS_2_8</name>
              <description>Exact seven-bit image produced by subtracting five from the linked phy_param byte and retaining the low seven bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_SAT_GAIN_IMAGE_0</name>
          <description>Complete bt_agc_sat_gain writes argument 0 as the complete register image. The dynamic image remains register-level evidence.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_SAT_GAIN_IMAGE_1</name>
          <description>Complete bt_agc_sat_gain writes argument 0 as the complete register image. The dynamic image remains register-level evidence.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_SAT_GAIN_CONFIG</name>
          <description>Complete bt_agc_sat_gain writes the complete finite image 0x00000404.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AGC_RECORRECT_CONTROL_006C</name>
          <description>Complete bt_agc_recorrect_set replaces the high byte with one finite image.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FINITE_BITS_24_31</name>
              <description>The leaf replaces this field with 0x0f.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_RESTART_CONFIG_0084</name>
          <description>Complete bt_agc_restart_set replaces the high byte with one finite image.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FINITE_BITS_24_31</name>
              <description>The leaf replaces this field with 0xf4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_SENSE_AND_DETECT_00A0</name>
          <description>Complete bt_bb_set_rx_sense publishes a complete dynamic image. Independent finite RMWs replace two positional fields used by the bounded baseband initializer.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_BITS_16_23</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_BITS_24_27</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
