ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>AGC_RESTART_IMAGE_00F8</name>
          <description>Five positional six-bit images written by complete bt_agc_restart_set; bits 1:0 remain unassigned.</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_2_7</name>
              <description>The leaf replaces this field with 0x0c.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_8_13</name>
              <description>The leaf replaces this field with 0x0c.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_14_19</name>
              <description>The leaf replaces this field with 0x20.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_20_25</name>
              <description>The leaf replaces this field with 5.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_26_31</name>
              <description>The leaf replaces this field with 0x0c.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_RESTART_IMAGE_0100</name>
          <description>Five positional high-nibble images written by complete bt_agc_restart_set; bits 11:0 remain unassigned.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_12_15</name>
              <description>The leaf replaces this field with 0x0a.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_16_19</name>
              <description>The leaf replaces this field with 8.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_20_23</name>
              <description>The leaf replaces this field with 6.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_24_27</name>
              <description>The leaf replaces this field with 6.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_28_31</name>
              <description>The leaf replaces this field with 6.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BTMAC_BLE_PHY_INIT</name>
      <description>ESP32-S31 BTMAC words initialized by the complete BLE PHY register-init
function. The function identity is supported by the matching ble_phy.c object
layout from the ESP32-C61 ecosystem library, while every address, mask and
value below comes only from the ESP32-S31 artifact. Neutral INIT names retain
the exact operation without promoting the cross-chip hint to hardware truth.</description>
      <baseAddress>0x20101400</baseAddress>
      <registers>
        <register>
          <name>INIT_ZERO_0074</name>
          <description>BLE PHY register initialization writes the complete zero image. Inner hardware semantics remain unknown.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_ENABLE</name>
          <description>BLE base-stack interrupt enable bank. BLE PHY initialization preserves only source 17 and later enables sources 11, 15, 20 and 24. The synchronous scheduler-run subscriber clears stale source 14 before enabling it here. All omitted source identities remain unknown.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOURCE_11</name>
              <description>The conditional BLE PHY initialization tail enables source 11. Its feature identity remains unknown.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCHEDULER_RUN</name>
              <description>The synchronous base-stack subscriber enables source 14 immediately before the scheduler RUN command.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOURCE_15</name>
              <description>The conditional BLE PHY initialization tail enables source 15. Its feature identity remains unknown.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOURCE_17</name>
              <description>BLE PHY initialization preserves source 17 while disabling every other interrupt source. Its feature identity remains unknown.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOURCE_20</name>
              <description>The conditional BLE PHY initialization tail enables source 20. Its feature identity remains unknown.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOURCE_24</name>
              <description>The conditional BLE PHY initialization tail enables source 24. Its feature identity remains unknown.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_CLEAR</name>
          <description>Write-one-to-clear BLE base-stack interrupt bank. Initialization acknowledges every source with an all-ones image; the synchronous scheduler-run subscriber acknowledges source 14 before enabling it.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SCHEDULER_RUN</name>
              <description>A one acknowledges stale scheduler-run source 14 before that source is enabled.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_CONTROL_00C4</name>
          <description>The conditional tail of complete BLE PHY register initialization sets bit 9 through a fresh-read RMW. All other bits are preserved and their meanings remain unknown.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_ENABLE_9</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_VALUE_0138</name>
          <description>BLE PHY register initialization writes the finite complete image 0x0000065B.</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_TX_ON_DELAY_CONFIG</name>
          <description>BLE transmit timing configuration. ble_tx_config_check independently prints byte zero as lc_tx_on_delay; BLE PHY initialization writes the same runtime-derived byte image into bytes zero and two.</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LC_TX_ON_DELAY</name>
              <description>Low byte printed as lc_tx_on_delay by complete ble_tx_config_check. BLE PHY initialization stores a configuration byte minus one.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_DUPLICATE_BYTE</name>
              <description>BLE PHY initialization receives the same configuration-byte-minus-one image as LC_TX_ON_DELAY. No independent semantic name is claimed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_0254</name>
          <description>BLE PHY initialization replaces the first three bytes with the exact images 0x01, 0x01 and 0xB2.</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2_LOW_7</name>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2_HIGH</name>
              <description>The first byte-two clear preserves this bit and the following OR forces it to one.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_CONTROL_0400</name>
          <description>BLE PHY initialization first writes bit 31 as a complete image and then sets bit 22 through a fresh-read RMW.</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_ENABLE_22</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_ENABLE_31</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_HIGH_HALF_0458</name>
          <description>BLE PHY initialization replaces the upper halfword with the finite image 0x000F.</description>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_HIGH_HALF</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_VALUE_045C</name>
          <description>BLE PHY register initialization writes the finite complete image 8.</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BRANCH_CONTROL_0470</name>
          <description>One complete BLE PHY initialization branch sets bit 18 through a fresh-read RMW. The alternate branch leaves the word unchanged; every other bit and the branch condition's hardware meaning remain unknown.</description>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_BY_PHY_INIT_BRANCH_BIT_18</name>
              <description>The complete BLE PHY initialization body's selected branch sets this positional bit. No independent enable, allowlist, or directed-advertising hardware meaning is proven.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_DYNAMIC_IMAGE_04A0</name>
          <description>BLE PHY initialization writes a runtime-derived complete image formed from a linked global address. The destination's hardware meaning remains unknown.</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_04A4</name>
          <description>BLE PHY register initialization writes four byte images equal to 2.</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_04A8</name>
          <description>BLE PHY register initialization writes four byte images equal to 2.</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONNECTION_ABORT_CONTROL</name>
          <description>Connection aborted-opcode control. BLE PHY initialization and the default aborted-opcode path write 0x00FF0002, while the custom-opcode path writes 0x00FF0003. Connection link-state refresh independently replaces bit 1 from its two private control flags.</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CUSTOM_OPCODE_ENABLED</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINK_STATE_CONTROL</name>
              <description>The complete connection link-state refresh clears this bit when its second private control flag is set, independently of the first flag, and sets it otherwise. The field selects the connection opcode-abort path; software-authenticated control PDUs require it cleared before RX publication.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_VALUE_0540</name>
          <description>BLE PHY register initialization writes the finite complete image 2000.</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_LOW_5_054C</name>
          <description>BLE PHY initialization replaces the low five bits with the finite image 0x12.</description>
          <addressOffset>0x54C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_LOW_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_0550</name>
          <description>BLE PHY initialization replaces the low three bytes with 0x03, 0x03 and 0x44.</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_0554</name>
          <description>BLE PHY initialization replaces all four bytes with 0x10, 0x10, 0x3C and 0x28.</description>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_0558</name>
          <description>BLE PHY initialization replaces all four bytes with 0x0C, 0x08, 0x0C and 0x0C.</description>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_BYTES_055C</name>
          <description>BLE PHY initialization replaces all four bytes with 0x08.</description>
          <addressOffset>0x55C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_BYTE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INIT_BYTE_3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
