ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLUETOOTH_SCHEDULER_INTERRUPT_RUNTIME</name>
      <description>Two scheduler words transferred with BLUETOOTH_INTERRUPT_BANK to the primary
hard handler. The complete source-124 suffix can read SCHEDULER_STATE at two
distinct temporal points and can write a complete zero image to
SCHEDULER_REFERENCE. Keeping this sparse physical view outside the task-side
controller partition prevents either owner from manufacturing an MMIO alias.
</description>
      <baseAddress>0x20101000</baseAddress>
      <registers>
        <register>
          <name>SCHEDULER_REFERENCE</name>
          <description>The source-124 handler can publish the complete zero image when bank-one source 3 observes an idle scheduler. Other scheduler users compare bits 0..19 or publish complete images; upper encoding remains unknown.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE_LOW_20</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>OPAQUE_HIGH_12</name>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHEDULER_STATE</name>
          <description>The source-124 handler reads this shared scheduler state at a bank-one reference gate and again before publishing deferred work. Its deferred-work predicate requires both STATE_29 and BUSY. The complete current-link-index leaf returns bits 23:20. Command transactions also wait while BUSY is set; other complete users consume or publish the low 20 and low 30 bits.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE_LOW_20</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>CURRENT_LINK_INDEX</name>
              <description>Zero-based current scheduler hardware-list index returned by the complete current-link-index leaf.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OPAQUE_STATE_24_28</name>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>STATE_29</name>
              <description>Positional state sampled together with BUSY by the complete source-124 deferred-work predicate. Its independent hardware meaning remains unqualified.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAQUE_STATE_30</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLUETOOTH_RESET_IDLE_STATUS_0</name>
      <description>One independently bounded Bluetooth baseband reset-idle status word. The
complete bbmac_idle_for_swrst leaf proves the exact predicate but neither
address adjacency nor the function name proves a wider physical block.</description>
      <baseAddress>0x20101550</baseAddress>
      <registers>
        <register>
          <name>STATUS</name>
          <description>bbmac_idle_for_swrst requires the observed low four-bit field to be zero before reporting idle.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_4_UNKNOWN</name>
              <description>The reset-idle predicate fails when this exact field is nonzero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SHARED_BASEBAND_RESET_IDLE_STATUS</name>
      <description>One independently bounded shared-baseband reset-idle status word. The complete
Bluetooth bbmac_idle_for_swrst leaf proves the exact predicate, but its location
inside another protocol aperture prevents Bluetooth-exclusive ownership.</description>
      <baseAddress>0x20103088</baseAddress>
      <registers>
        <register>
          <name>STATUS</name>
          <description>bbmac_idle_for_swrst requires the observed low four-bit field to be zero before reporting idle.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_4_UNKNOWN</name>
              <description>The reset-idle predicate fails when this exact field is nonzero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SHARED_BASEBAND_TX_TIMING</name>
      <description>One physical baseband timing word reached by the common BTBB initializer.
The named vendor leaf carries a historical Zigbee prefix, but the current
evidence proves only the exact shared initialization transaction and does not
grant protocol-exclusive ownership.</description>
      <baseAddress>0x20102010</baseAddress>
      <registers>
        <register>
          <name>AUXILIARY_TX_ON_DELAY</name>
          <description>The complete named setter replaces bits 16:26 with an encoded argument image and preserves every other bit.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENCODED_IMAGE</name>
              <description>The setter stores ((argument - 10) &lt;&lt; 3) in this eleven-bit field; its low three bits therefore become zero.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
