ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BTDM_SCHEDULER_TABLE</name>
      <description>Sixteen-entry scheduler hardware-list table. Complete current insertion-begin,
insertion-end and lifecycle bodies prove the finite entry count, 0x10-byte
stride and low-20-bit compressed SRAM head. Same-chip public named header
accessors independently establish the hardware-list role. The upper twelve
bits and the unobserved words inside each stride remain unknown.
</description>
      <baseAddress>0x2010B000</baseAddress>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>ENTRY%s</name>
          <description>Scheduler hardware-list entry. Bits 0..19 hold a compressed SRAM head and bits 20..31 remain unassigned.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD_POINTER</name>
              <description>Compressed four-byte-aligned 0x2f-prefixed SRAM hardware-list head. Zero denotes no published head.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BTDM_RUNTIME_CONTROL</name>
      <description>Sparse BTDM low-level runtime and sleep-control window. Complete ESP32-S31
functions prove only the recorded access directions, finite images, low-24-bit
publications and four isolated RMW controls. The independently role-mapped
runtime-timer start command is named; all other positional names deliberately
avoid assigning undocumented peripheral semantics.
</description>
      <baseAddress>0x2010D000</baseAddress>
      <registers>
        <register>
          <name>RUNTIME_TIMER_START_COMMAND</name>
          <description>Complete current leaf writes finite image 1; an instruction-identical public same-chip predecessor identifies the operation as r_btdm_hal_rtc_start.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COMMAND</name>
              <description>Complete command image that starts the BTDM runtime timer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the runtime timer during controller hardware enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0004</name>
          <description>Complete runtime functions write the finite image 1.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0008</name>
          <description>Complete initialization writes the finite image 1.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0010</name>
          <description>Complete runtime functions write the independently observed finite images 2 and 0x00040000.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0014</name>
          <description>Complete runtime functions write the independently observed finite images 0xFFFFFFFF and 0x00040000.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_001C</name>
          <description>One complete runtime function reads the complete word and writes the finite zero image. Inner state encoding remains unknown.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_0020</name>
          <description>Complete state word read by runtime functions and cleared by two complete paths.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_0024</name>
          <description>State word whose low byte is sampled independently; complete writes publish the finite images zero and one.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_BYTE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_31_8</name>
              <description>Upper bits covered by complete-register evidence but not assigned a semantic role.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_002C</name>
          <description>State word whose low byte is sampled independently; complete runtime paths clear the word.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOW_BYTE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_31_8</name>
              <description>Upper bits covered by complete-register evidence but not assigned a semantic role.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0034</name>
          <description>Complete initialization writes the finite image 0xFFFFFFFF.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_0038</name>
          <description>Complete word read by a runtime status path.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0040</name>
          <description>Complete runtime functions write finite images with independently observed bits 0, 16 and 17.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_0044</name>
          <description>Complete runtime functions write finite images with independently observed bits 0, 16 and 17.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_0048</name>
          <description>Complete word read by multiple runtime functions.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_004C</name>
          <description>Complete initialization writes the finite zero image.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL_0058</name>
          <description>Shared runtime control word with independently observed RMW operations over bits 0, 1, 2 and 4. Other bits are preserved.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONTROL_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CONTROL_4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_0064</name>
          <description>One complete runtime function reads the complete word and publishes complete dynamic images. The image remains a register-level fact.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>VALUE_0068</name>
          <description>Complete publication replaces bits 0..23 with a runtime-derived value and clears bits 24..31.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE_LOW_24</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_006C</name>
          <description>Complete word is read by one runtime path and receives either a complete runtime-derived image or a runtime-derived low-24-bit image.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL_0078</name>
          <description>Initialization sets bit 25 through a fresh-read RMW. Other bits are preserved.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONTROL_25</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
