ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_POSITIONAL_WORD_1FF0</name>
      <description>Narrow owner for the otherwise unbounded word at 0x20101FF0. Complete
ESP32-S31 BLE PHY initialization writes complete image zero followed by
complete image one before touching any other radio register. The same ordered
writes appear at the same block offset in the named ESP32-C61 counterpart, but
neither artifact proves this word's hardware action or membership in the
adjacent BTMAC dump range. No wider peripheral extent is claimed.
</description>
      <baseAddress>0x20101FF0</baseAddress>
      <registers>
        <register>
          <name>VALUE</name>
          <description>Complete ordered images zero then one at BLE PHY register-initialization entry; their hardware meaning remains unknown.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE</name>
              <description>Complete positional image; only the ordered zero-then-one publications are proven.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_POSITIONAL_WORD_891C</name>
      <description>Narrow owner for the otherwise isolated word at 0x2010891C. Complete
ESP32-S31 BLE PHY initialization writes complete image 0x20 before initializing
the BLE hardware accelerator and complete image 0x40 after the surrounding
BTMAC and accelerator sequence. The register's physical block, hardware action
and the meanings of the two images remain unproved, so no neighboring
0x201088xx words are absorbed.
</description>
      <baseAddress>0x2010891C</baseAddress>
      <registers>
        <register>
          <name>VALUE</name>
          <description>Complete ordered images 0x20 then 0x40 around BLE accelerator initialization; their hardware meaning remains unknown.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE</name>
              <description>Complete positional image; only the ordered 0x20-then-0x40 publications are proven.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_CONTROLLER_ADDRESS_SLOTS</name>
      <description>Three positional six-byte controller address slots. A complete ESP32-S31
ble_phy.c leaf proves the selector range, pair stride, byte packing and write
order. Named callers identify public-address use of slot zero and
random-address use of slot one; slot two remains intentionally unnamed.
</description>
      <baseAddress>0x2010180C</baseAddress>
      <registers>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>SLOT%s_LOW</name>
          <description>Bytes zero through three of the selected six-byte value, packed in little-endian order and written before the paired high word.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OCTETS_0_TO_3</name>
              <description>The complete low word assembled from input bytes zero through three.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>SLOT%s_HIGH</name>
          <description>Bytes four and five of the selected six-byte value in bits 0..15; the complete write clears bits 16..31.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OCTETS_4_TO_5</name>
              <description>Input bytes four and five packed in little-endian order.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_POSITIONAL_WORD_1874</name>
      <description>Narrow positional owner for one word at 0x20101874 written by six complete
ble_hw.c paths. Neither the destination's hardware action nor the dynamic
value's inner meaning is claimed.
</description>
      <baseAddress>0x20101874</baseAddress>
      <registers>
        <register>
          <name>VALUE</name>
          <description>Observed complete publications contain a dynamic value in bits 0..19 and zero in bits 20..31.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DYNAMIC_LOW_20_IMAGE</name>
              <description>Dynamic low-twenty-bit image. Complete writes clear bits 20..31; no pointer, index, queue or event semantic is established.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_SYNC_PUBLICATION</name>
      <description>Two positional write-only words used by one ble_lll_sync.c path. The source
identity records software context only; the register names deliberately do
not turn that context into an undocumented hardware meaning.
</description>
      <baseAddress>0x20101878</baseAddress>
      <registers>
        <register>
          <name>VALUE_0</name>
          <description>One runtime-derived complete 32-bit image.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_1</name>
          <description>One runtime-derived low-24-bit image; the complete publication writes bits 24..31 as zero.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE_LOW_24</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
