ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_SCAN_CONTROL</name>
      <description>Three positional complete images published by one ble_lll_scan.c path. The
source file establishes scan-path ownership, but the undocumented hardware
actions represented by the images remain unknown.
</description>
      <baseAddress>0x20101970</baseAddress>
      <registers>
        <register>
          <name>COMMAND_0</name>
          <description>The observed path publishes the finite complete images 0x00000100 and 0x00000001 at different points.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_1</name>
          <description>Both observed publications write the finite complete image one.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND_2</name>
          <description>Both observed publications write the finite complete image one.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_ACCELERATOR</name>
      <description>Sparse ESP32-S31 BLE hardware-accelerator view. Complete ble_hw.c operations
independently prove encryption and resolving-list engines in this physical
block; complete BLE PHY initialization proves three additional initialization
words. Cross-chip objects provide function identities only. Addresses, field
geometry, values, ordering and predicates all come from ESP32-S31 bytes.
</description>
      <baseAddress>0x20109800</baseAddress>
      <registers>
        <register>
          <name>INIT_CONFIG</name>
          <description>BLE PHY initialization writes the complete finite image 0x000002F0. Inner semantics remain unknown.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_START</name>
          <description>r_ble_hw_encrypt_block writes the complete value 1 after publishing all encryption parameters.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COMMAND</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_CONFIG</name>
          <description>r_ble_hw_encrypt_block writes the finite complete image 1 before publishing buffer pointers.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_BLOCK_LENGTH</name>
          <description>r_ble_hw_encrypt_block writes the finite complete image 16.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTES</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_KEY_WORD_0</name>
          <description>Little-endian word assembled from encryption-key argument bytes 0 through 3.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_KEY_WORD_1</name>
          <description>Little-endian word assembled from encryption-key argument bytes 4 through 7.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_KEY_WORD_2</name>
          <description>Little-endian word assembled from encryption-key argument bytes 8 through 11.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_KEY_WORD_3</name>
          <description>Little-endian word assembled from encryption-key argument bytes 12 through 15.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_INPUT_BUFFER_ADDRESS</name>
          <description>Complete pointer image equal to the r_ble_hw_encrypt_block argument base plus 16.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_OUTPUT_BUFFER_ADDRESS</name>
          <description>Complete pointer image equal to the r_ble_hw_encrypt_block argument base plus 32.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_SEARCH_START</name>
          <description>r_ble_hw_resolv_list_search writes the complete finite image 1 after publishing its inputs.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COMMAND</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_LIST_ARGUMENT</name>
          <description>Complete first argument published by r_ble_hw_resolv_list_search.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_SEARCH_ARGUMENT</name>
          <description>Second search argument in bits 0..27 and a Boolean third-argument mode in bit 28.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ARGUMENT_LOW_28</name>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_RESULT_METADATA</name>
          <description>Search result word; r_ble_hw_resolv_list_search returns bits 8..15 through its fourth argument. Other bits remain unknown.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT_BYTE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_RESULT_POINTER_OFFSET</name>
          <description>Search result combined with SRAM prefix 0x2F000000 to form the returned pointer. The exact encoded width remains unknown.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_RESULT_PRESENT</name>
          <description>Complete word tested for zero before the result pointer and metadata are consumed.</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENGINE_CONTROL</name>
          <description>Shared control word: encryption sets bits 0..1 through RMW; resolving-list search writes the finite complete image 0x400.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENCRYPT_CONFIG_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESOLV_CONFIG_BIT</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLV_STATUS</name>
          <description>r_ble_hw_resolv_list_search polls bit 2 with a finite software timeout.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COMPLETE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCRYPT_COMPLETION_STATUS</name>
          <description>r_ble_hw_encrypt_block polls the complete word until nonzero, with a finite software timeout. Inner encoding remains unknown.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_SRAM_REGION_0</name>
          <description>BLE PHY initialization writes the complete finite image 0x2F080000. Inner semantics remain unknown.</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT_SRAM_REGION_1</name>
          <description>BLE PHY initialization writes the complete finite image 0x2F000000. Inner semantics remain unknown.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
