ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_RESOLVING_LIST</name>
      <description>Narrow owner for the standalone BLE resolving-list base publication. The
complete ESP32-S31 ble_hw.c leaf proves one compressed SRAM pointer word but
does not prove that adjacent BTMAC addresses belong to the same logical block.
</description>
      <baseAddress>0x20101880</baseAddress>
      <registers>
        <register>
          <name>BASE_POINTER</name>
          <description>Complete image equal to the caller-provided SRAM address shifted right by two and truncated to twenty bits.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COMPRESSED_SRAM_POINTER</name>
              <description>Bits 0..19 contain address &gt;&gt; 2; bits 20..31 are written as zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_RUNTIME_CONTROL</name>
      <description>Sparse BLE hardware status/clear and runtime-configuration view. Complete
ESP32-S31 functions prove the array geometry, access directions and exact
configuration images. Positional names retain unknown source and field
semantics instead of promoting diagnostic strings to hardware truth.
</description>
      <baseAddress>0x20101B00</baseAddress>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>STATUS%s</name>
          <description>Complete status word read once for each of eight sources before optional diagnostic reporting.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PENDING_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CLEAR%s</name>
          <description>Paired clear word receiving the complete image 0xFFFFFFFF for each of eight sources.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PENDING_BITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_INIT_CONFIGURATION</name>
          <description>Complete BLE PHY initialization publishes one runtime-derived low byte together with finite bit 8 as a whole-word image. The byte encoding remains unknown.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE_LOW_8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONFIG_8</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_INIT_CONFIGURATION_FOLLOWUP</name>
          <description>Complete BLE PHY initialization writes the finite complete image one immediately after PHY_INIT_CONFIGURATION. The hardware meaning of this ordered follow-up write remains unknown.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_0088</name>
          <description>Complete image formed from the low five bits of one controller configuration byte.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE_LOW_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_0090</name>
          <description>Complete image formed from two low-five-bit controller values in bits 0..4 and 8..12 plus finite one bits at positions 5 and 13.</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CONFIG_5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALUE_1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CONFIG_13</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_0094</name>
          <description>Complete image formed from one controller configuration byte.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VALUE_LOW_8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
