ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_HW_CTE_RING_CONTROL</name>
      <description>Direction-finding ring state recovered from complete ESP32-S31 ble_hw_cte.c
leaves. Ordinary advertising, scanning and connection link states retain a
controller-global disabled-CTE descriptor even when IQ sampling is not
requested, so the baseline pointer and ownership fields are part of the
minimum standalone BLE controller.
</description>
      <baseAddress>0x2010199C</baseAddress>
      <registers>
        <register>
          <name>RING_CONTROL</name>
          <description>Reset writes the complete word as zero; independent accessors update the ring index and maximum-buffer fields through halfword RMW operations.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAX_BUFFER_NUMBER</name>
              <description>The setter truncates its argument to three bits and replaces bits 12..14; the getter returns the same field.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RING_BUFFER_INDEX_CLEAR</name>
              <description>The named clear accessor sets bit 15. The active level and any hardware self-clear behavior remain unproven.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>BUFFER_POINTER%s</name>
          <description>Compressed controller-SRAM address of one CTE sample-ring descriptor. The setter replaces bits 0..19 and preserves the upper twelve bits.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPRESSED_DESCRIPTOR_POINTER</name>
              <description>Low-twenty-bit controller-SRAM pointer reconstructed with the fixed 0x2f prefix and four-byte alignment.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>BUFFER_STATE%s</name>
          <description>Hardware state paired with one CTE sample-ring descriptor. Only the software-ownership flag is currently assigned.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOFTWARE_OWNED</name>
              <description>The named owner-clear/set leaves respectively clear and set bit 31; the paired query returns that bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE_ISO_SCHEDULER_NOTIFY</name>
      <description>Narrow late-feature owner for the command written by two complete ISO-path
functions. A positional capability is intentional: the observed write strobe
is exact, while the undocumented hardware action is not inferred from the
software queue context.
</description>
      <baseAddress>0x20101424</baseAddress>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>Both observed ISO-path publications write the complete value one.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>Observed command image is one; hardware self-clear and command meaning remain unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BT_V3_2_BASEBAND</name>
      <description>Bluetooth baseband control and status words recovered from complete, named
bt_bb_v2.o accessors in the ESP32-S31 vendor library. Field geometry and
argument-to-field transforms are exact. ARGUMENT_N labels deliberately retain
unknown C signature semantics rather than inventing a hardware meaning.</description>
      <baseAddress>0x20102000</baseAddress>
      <registers>
        <register>
          <name>RX_SETUP_CONTROL_0</name>
          <description>Complete bt_bb_rx_set sets positional bit 0 through a fresh-read RMW. Its independent hardware meaning remains unknown.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_BY_RX_SETUP_BIT_0</name>
              <description>Complete bt_bb_rx_set sets this positional bit. No enable semantic is proven.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_POWER_CONTROL</name>
          <description>The named channel-power set/unset leaves set or clear this aggregate two-bit field through fresh-read RMW operations; individual bit meanings remain unknown.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL_POWER_BITS_8_9</name>
              <description>bt_get_channel_pwr_set replaces the field with 3 and bt_get_channel_pwr_unset replaces it with 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SETUP_IMAGE_0</name>
          <description>The bounded TX setup clears bits 8:11; the subsequent RX setup preserves the low 12 bits and replaces bits 31:12 with the finite image 0x0199A.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_IMAGE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_SETUP_IMAGE</name>
              <description>bt_bb_v2_tx_set replaces this positional field with zero.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LE_TX_ON_DELAY</name>
          <description>Bluetooth LE transmit-on delay. The public API exposes the decoded value; the register stores value minus 10.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_ZERO_BITS_16_18</name>
              <description>bt_bb_set_le_tx_on_delay clears these three low positional bits in the same RMW that writes the encoded delay. Their hardware meaning remains unknown.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ENCODED_VALUE_MINUS_10</name>
              <description>bt_bb_set_le_tx_on_delay stores argument 0 minus 10; bt_bb_get_le_tx_on_delay returns this field plus 10.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CONFIG_CHECK_VALUE</name>
          <description>ble_tx_config_check consumes only this high five-bit image in diagnostic arithmetic; its underlying hardware meaning remains unknown.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HIGH_5_UNKNOWN</name>
              <description>Exact value produced by shifting the complete register image right by 27.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SETUP_CONTROL_1</name>
          <description>Complete bt_bb_rx_set sets positional bit 2 through a fresh-read RMW. Its independent hardware meaning remains unknown.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_BY_RX_SETUP_BIT_2</name>
              <description>Complete bt_bb_rx_set sets this positional bit. No enable semantic is proven.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE_CORRELATION_THRESHOLD_0</name>
          <description>Bluetooth LE correlation-threshold control. Only independently observed fields are assigned.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AA_LC_ENABLE</name>
              <description>bt_bb_corr_thresh_aa_lc_en replaces this bit with the Boolean image of argument 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARGUMENT_2</name>
              <description>bt_bb_set_corr_thresh_le copies its six-bit argument 2 image into this field.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE_CORRELATION_THRESHOLD_1</name>
          <description>Two independently replaced six-bit Bluetooth LE correlation-threshold images.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARGUMENT_1</name>
              <description>bt_bb_set_corr_thresh_le copies its six-bit argument 1 image into this field.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ARGUMENT_0</name>
              <description>bt_bb_set_corr_thresh_le copies its six-bit argument 0 image into this field.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CORRELATOR_CONTROL</name>
          <description>Bluetooth receive-correlator control. The finite initializer sets a low control bit and later replaces the independently observed six-bit configuration value.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_VALUE</name>
              <description>bt_bb_rx_correlator_set replaces this field with the finite value 8.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_SETUP_ENABLE</name>
              <description>bt_agc_restart_set sets this independently observed low control bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FINAL_FORCE_ZERO_13</name>
              <description>bt_bb_v2_rx_set clears this independently observed control bit after the receive leaf sequence.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFTWARE_RESET_IDLE_STATUS</name>
          <description>bbmac_idle_for_swrst requires both independently tested status fields to be zero before reporting idle.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IDLE_BITS_15_16_UNKNOWN</name>
              <description>The reset-idle predicate fails when this exact two-bit field is nonzero.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IDLE_BITS_20_23_UNKNOWN</name>
              <description>The reset-idle predicate fails when this exact four-bit field is nonzero.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CURRENT_RX_INFO</name>
          <description>Complete current Bluetooth receive-information image returned by bt_bb_get_cur_rx_info. Inner status encoding remains unknown.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CCA_CONTROL_0</name>
          <description>First Bluetooth transmit-CCA control word, including the period transform and fields supplied by bt_bb_tx_cca_set.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APPLY</name>
              <description>bt_bb_tx_cca_set unconditionally sets this bit after updating argument fields. No wider trigger semantics are claimed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_1</name>
              <description>Eight-bit image of bt_bb_tx_cca_set argument 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PERIOD_ARGUMENT_0_IMAGE</name>
              <description>Eleven-bit image produced by bt_bb_tx_cca_period from argument 0 using the exact vendor arithmetic.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PERIOD_FORCE_ZERO_20_22</name>
              <description>bt_bb_tx_cca_period explicitly clears bits 20:22 in the same fresh-read update that replaces bits 23:30.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PERIOD_ARGUMENT_0_MINUS_ARGUMENT_1_IMAGE</name>
              <description>Eight-bit image produced by bt_bb_tx_cca_period from arguments 0 and 1 using the exact vendor arithmetic.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SET_ARGUMENT_0</name>
              <description>Boolean image of bt_bb_tx_cca_set argument 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CCA_CONTROL_1</name>
          <description>Second Bluetooth transmit-CCA control word. Argument meaning is not available from the stripped C signature.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_ARGUMENT_4</name>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_3</name>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_2</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEFAULT_CONFIG_VALUE</name>
              <description>bt_bb_cca_config replaces this field with the finite value 5.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_SETUP_ENABLE</name>
              <description>bt_bb_rx_set sets this independently observed bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CCA_CONTROL_2</name>
          <description>Third Bluetooth transmit-CCA control word. Argument meaning is not available from the stripped C signature.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_ARGUMENT_9</name>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_8</name>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_7</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_6</name>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SET_ARGUMENT_5</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SETUP_ENABLE</name>
              <description>bt_bb_rx_set sets this bit after clearing RX_SETUP_DISABLE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SETUP_DISABLE</name>
              <description>bt_bb_rx_set clears this bit before setting RX_SETUP_ENABLE.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SETUP_ARGUMENT</name>
          <description>The bounded TX and RX setup leaves update two adjacent positional argument fields through separate fresh reads.</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARGUMENT_0</name>
              <description>bt_bb_rx_set copies its six-bit argument 0 image into this positional field.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_ARGUMENT_0</name>
              <description>bt_bb_v2_tx_set copies its six-bit argument 0 image into this positional field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CCA_FIFO_STATUS</name>
          <description>Bluetooth transmit-CCA FIFO reset and status word recovered from five dedicated accessors.</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>bt_bb_tx_cca_fifo_reset sets this bit.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COUNT</name>
              <description>Four-bit value returned by bt_bb_tx_cca_fifo_count.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>Boolean returned by bt_bb_tx_cca_fifo_empty.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FULL</name>
              <description>Boolean returned by bt_bb_tx_cca_fifo_full.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
