ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>TX_CCA_FIFO_DATA</name>
          <description>Complete 32-bit FIFO word returned by bt_bb_tx_cca_fifo_read; inner encoding remains unknown.</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WATCHDOG_CONTROL</name>
          <description>Bluetooth baseband watchdog initialization word. Only the exact bt_bb_wdt_init writes are assigned.</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT_ARGUMENT_1</name>
              <description>Two-bit image of bt_bb_wdt_init argument 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INIT_ARGUMENT_0</name>
              <description>Sixteen-bit image of bt_bb_wdt_init argument 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INIT_FORCE_ONE</name>
              <description>bt_bb_wdt_init sets this bit before writing both argument fields.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_1M_COEFFICIENT_0</name>
          <description>First word configured by the complete set_gauss_coeff_1m leaf; names retain positional fields because individual coefficient semantics are unknown.</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_2_9</name>
              <description>The leaf replaces this field with 0x13.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_10_16</name>
              <description>The leaf replaces this field with 3.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_17_22</name>
              <description>The leaf replaces this field with 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_23_27</name>
              <description>The leaf replaces this field with 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_28_31</name>
              <description>The leaf replaces this field with 0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_1M_COEFFICIENT_1</name>
          <description>Second word configured by the complete set_gauss_coeff_1m leaf.</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_2_12</name>
              <description>The leaf replaces this field with 0x2f2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_13_22</name>
              <description>The leaf replaces this field with 0x140.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_23_31</name>
              <description>The leaf replaces this field with 0x5f.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_1M_COEFFICIENT_2</name>
          <description>Third word configured by the complete set_gauss_coeff_1m leaf.</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_10_20</name>
              <description>The leaf replaces this field with 0x6bf.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_21_31</name>
              <description>The leaf replaces this field with 0x50d.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_1M_COEFFICIENT_3</name>
          <description>Fourth word configured by the complete set_gauss_coeff_1m leaf.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_10_20</name>
              <description>The leaf replaces this field with 0x7e9.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_21_31</name>
              <description>The leaf replaces this field with 0x7a0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_2M_COEFFICIENT_AND_TX_CONFIG</name>
          <description>The complete 2M Gaussian-coefficient leaf owns bits 31:8 while bt_bb_v2_tx_set independently owns the low-byte image of this same physical word.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_SET_LOW_BYTE</name>
              <description>bt_bb_v2_tx_set replaces this field with 0xf5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GAUSSIAN_BITS_8_16</name>
              <description>set_gauss_coeff_2m replaces this field with 0x69.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GAUSSIAN_BITS_17_24</name>
              <description>set_gauss_coeff_2m replaces this field with 7.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GAUSSIAN_BITS_25_31</name>
              <description>set_gauss_coeff_2m replaces this field with 0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUSSIAN_2M_COEFFICIENT_1</name>
          <description>Second word configured by the complete set_gauss_coeff_2m leaf; its three observed fields cover the complete physical word.</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BITS_0_10</name>
              <description>The leaf replaces this field with 0x78f.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_11_21</name>
              <description>The leaf replaces this field with 0x5a7.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BITS_22_31</name>
              <description>The leaf replaces this field with 0x258.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LE_CORRELATION_THRESHOLD_2</name>
          <description>Two copies of bt_bb_set_corr_thresh_le argument 1 in independently replaced six-bit fields.</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARGUMENT_1_COPY_0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ARGUMENT_1_COPY_1</name>
              <bitOffset>19</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_RESTART_CONTROL</name>
          <description>bt_agc_restart_set independently sets eight observed bits through separate fresh-read RMW operations; individual bit meanings remain unknown.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESTART_BIT_6_UNKNOWN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_7_UNKNOWN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_8_UNKNOWN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_9_UNKNOWN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_10_UNKNOWN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_19_UNKNOWN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_20_UNKNOWN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESTART_BIT_21_UNKNOWN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FILTER_SELECT</name>
          <description>Six independent two-bit Bluetooth receive-filter selections configured by bt_bb_rx_filter_sel. Individual path meanings remain unknown.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELECT_0</name>
              <description>Configured to the finite value 2.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELECT_1</name>
              <description>Configured to the finite value 2.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELECT_2</name>
              <description>Configured to the finite value 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELECT_3</name>
              <description>Configured to the finite value 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELECT_4</name>
              <description>Configured to the finite value 2.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELECT_5</name>
              <description>Configured to the finite value 1.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_DIAGNOSTIC</name>
          <description>Three independently replaced Bluetooth diagnostic selector images.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARGUMENT_1</name>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ARGUMENT_3</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ARGUMENT_2</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CONFIG</name>
          <description>Bluetooth baseband coexistence configuration written by bt_bb_coex_config. Only two finite one-bits are assigned.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ONE_18</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIG_FORCE_ONE_20</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DPO_CONTROL</name>
          <description>Bluetooth receive-DPO configuration written by bt_bb_rx_dpo_set. Inner DPO meaning remains unknown.</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ZERO_19</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIG_VALUE</name>
              <description>bt_bb_rx_dpo_set replaces this field with the finite value 2.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
