ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BT_V3_2_CTE</name>
      <description>Bluetooth direction-finding control words recovered from complete, independently
named CTE accessors in the ESP32-S31 vendor baseband library. Only fields touched
by those accessors are described; untouched bits remain unassigned.</description>
      <baseAddress>0x20102000</baseAddress>
      <registers>
        <register>
          <name>LC_8M_CONTROL</name>
          <description>Bluetooth CTE LC 8-Mbit enable control.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LC_8M_ENABLE</name>
              <description>The matched getter/setter pair reads and replaces bit 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL</name>
          <description>CTE antenna selection, receive-delay, IQ-selection and enable control. Bit 0 remains unassigned.</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANTENNA_ONEHOT_ENABLE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IQ_SELECT_2US</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IQ_SELECT_1US</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DELAY_RX_AOD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DELAY_RX_AOA</name>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ANTENNA_FORCE</name>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ANTENNA_FORCE_ON</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTE_ENABLE</name>
              <description>Complete ble_bb_cte_set_cte_en replaces bit 31 with the caller's Boolean image.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_DELAY</name>
          <description>Four independent eight-bit antenna delays selected by CTE direction and slot duration.</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_AOA_2US</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOA_1US</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_AOD_2US</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_AOD_1US</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_SWITCH_DELAY_1M</name>
          <description>Four independent antenna-switch delays used by the ordinary CTE accessors.</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_AOA_2US</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOA_1US</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOD_2US</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOD_1US</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x2</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>ANTENNA_MAP_ENTRY%s</name>
          <description>First sixteen halfword slots of the indexed antenna-map window. The complete setter copies caller-provided halfwords from index zero up to its input count; sixteen slots are the exact finite effects recovered under the current analysis bound, not a claim that the hardware window ends here.</description>
          <addressOffset>0x130</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IMAGE</name>
              <description>Complete 16-bit antenna-map element; the encoding remains unknown.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE_LIMIT</name>
          <description>Three independently readable and writable CTE sampling-limit fields.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SWITCH</name>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REFERENCE</name>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_TAIL_1US</name>
          <description>Four independent receive-tail delays for ordinary and 2-Mbit CTE operation with 1-microsecond slots.</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_AOD_2M</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOA_2M</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOD</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOA</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_SWITCH_DELAY_2M</name>
          <description>Four independent antenna-switch delays used by the explicit 2-Mbit CTE accessors.</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_AOA_2US</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOA_1US</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOD_2US</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_AOD_1US</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_STEP_CONTROL</name>
          <description>CTE frequency-step enable, count and 20-bit step image. Bits 0:2 and 10:11 remain unassigned.</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FSTEP_CTE_ENABLE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NFSTEP_CTE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FSTEP_CTE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_TAIL_2US</name>
          <description>Four independent receive-tail delays for ordinary and 2-Mbit CTE operation with 2-microsecond slots.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_AOD_2M</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOA_2M</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOD</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_AOA</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI_CONTROL</name>
          <description>CTE signal-quality-indicator enable, selector and per-rate delay fields.</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQI_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQI_SELECT</name>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SQI_DELAY_2M</name>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SQI_DELAY</name>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI_DPHI</name>
          <description>CTE SQI phase-difference thresholds/status. The byte at bits 15:8 is exposed both as SQI_DPHI_DB and, independently, bit 14 as SQI_READY; the non-overlapping model preserves that exact alias in one combined field.</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQI_DPHI_DB_OR_READY</name>
              <description>Eight-bit SQI_DPHI_DB image; bit 6 of this field is also the independently addressable SQI_READY bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SQI_DPHI_MAX</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SQI_DPHI_MIN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI_LIMITS</name>
          <description>Four independent eight-bit in-band and RSSI thresholds used by the CTE SQI logic.</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INBAND_MAX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RSSI_MAX</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INBAND_MIN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RSSI_MIN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE_AND_CLOCK</name>
          <description>Bluetooth baseband date image and CTE clock gates. Bits 31:30 remain unassigned.</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BT_BB_DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLOCK_ENABLE</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLOCK_FORCE_ON</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
