ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ZBBB_RADIO_CONTROL</name>
      <description>Independently bounded words in the ZBBB window touched by complete Bluetooth
baseband receive-setup and reset-idle leaves. Names describe only those exact
operations; they do not claim that the physical block is owned exclusively by
Bluetooth or assign a wider ZBBB protocol meaning.</description>
      <baseAddress>0x20102C00</baseAddress>
      <registers>
        <register>
          <name>RX_SETUP_IMAGE</name>
          <description>bt_bb_rx_set preserves the low 12 bits and replaces bits 31:12 with the finite image 0x001CB; after the shared receive prefix, bt_bb_v2_init_cmplx(1) independently replaces the same field with 0x0019F.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_IMAGE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SETUP_CONTROL</name>
          <description>bt_bb_rx_set clears bit 8 and the low two-bit field through separate fresh-read RMW operations; the complete shared receive initializer independently replaces bits 10:20.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_FORCE_ZERO_LOW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONFIG_FORCE_ZERO_8</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHARED_INIT_IMAGE_10_20</name>
              <description>The complete shared receive initializer replaces bits 10:20 with the finite image 0x79C.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_IMAGE_0</name>
          <description>The complete shared receive initializer replaces two disjoint positional fields with finite images while preserving every other bit.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE_13_20</name>
              <description>The complete initializer replaces bits 13:20 with the finite image 0xA6.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_IMAGE_21_31</name>
              <description>The complete initializer replaces bits 21:31 with the finite image 0x792.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_CONTROL_0</name>
          <description>The complete shared receive initializer clears one positional control bit and preserves the remainder of the word.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_FORCE_ZERO_1</name>
              <description>The complete initializer clears bit 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_IMAGE_1</name>
          <description>The complete shared receive initializer replaces the low eleven bits with one finite image.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE_0_10</name>
              <description>The complete initializer replaces bits 0:10 with the finite image 0x7A6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_CONTROL_1</name>
          <description>The complete shared receive initializer sets one positional control bit and preserves the remainder of the word.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_FORCE_ONE_30</name>
              <description>The complete initializer sets bit 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_IMAGE_2</name>
          <description>The complete shared receive initializer replaces the high twenty-four bits and low byte through two disjoint fresh-read updates.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE_0_7</name>
              <description>The complete initializer replaces bits 0:7 with the finite image 0xF1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_IMAGE_8_31</name>
              <description>The complete initializer replaces bits 8:31 with the finite image 0x07A120.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_IMAGE_3</name>
          <description>The complete shared receive initializer replaces the high twenty-four bits with one finite image.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_IMAGE_8_31</name>
              <description>The complete initializer replaces bits 8:31 with the finite image 0xF85EDF.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_RX_INIT_IMAGE_4</name>
          <description>The complete shared receive initializer replaces three disjoint positional fields with finite images.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POSITIONAL_FORCE_ONE_0</name>
              <description>The complete initializer sets bit 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSITIONAL_IMAGE_9_19</name>
              <description>The complete initializer replaces bits 9:19 with the finite image 0x7ED.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POSITIONAL_IMAGE_20_30</name>
              <description>The complete initializer replaces bits 20:30 with the finite image 0x7E1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFTWARE_RESET_IDLE_STATUS</name>
          <description>bbmac_idle_for_swrst reports idle only when the observed low three-bit image equals one.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOW_3_REQUIRED_IMAGE</name>
              <description>The reset-idle predicate compares this exact field with the finite image 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
