ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_AGC_RECOVERED_GAPS</name>
      <description>Sparse AGC words absent from the public platform PAC.</description>
      <baseAddress>0x20107000</baseAddress>
      <registers>
        <register>
          <name>RX_SENSE_WORD_0_OPAQUE</name>
          <description>Read-modify-written by complete phy_rx_sense_set and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RX_SENSE_WORD_1_OPAQUE</name>
          <description>Read-modify-written by complete phy_rx_sense_set and saved/restored by complete phy_dig_reg_backup.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CCA_CONTROL_OPAQUE</name>
          <description>Read and written by complete CCA accessors and saved/restored by complete phy_dig_reg_backup; fields remain unnamed.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NOISE_FLOOR_STATUS_OPAQUE</name>
          <description>Complete phy_get_noise_floor reads this word; hardware access semantics remain unknown.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RSSI_STATUS_OPAQUE</name>
          <description>Complete phy_get_rssi reads this word; hardware access semantics remain unknown.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CHANNEL_FILTER_CONTROL_OPAQUE</name>
          <description>Complete phy_chan_filt_set read-modify-writes this word and complete phy_dig_reg_backup saves/restores it.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BACKUP_WORD_CC_OPAQUE</name>
          <description>Complete phy_dig_reg_backup saves and restores this word; all field semantics remain unknown.</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RIFS_MODE_CONTROL_OPAQUE</name>
          <description>Complete phy_wifi_rifs_mode_en read-modify-writes bit zero; all other fields remain unknown.</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RX_SENSE_BACKUP_WORD_OPAQUE</name>
          <description>Read by complete phy_rx_sense_set and saved/restored by complete phy_dig_reg_backup; field semantics remain unknown.</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFO_CONFIG_WORD_1_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg replaces this word and independently read-modify-writes bit 27; the hardware field meaning remains unknown.</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BIT_27_CONTROL_UNKNOWN</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_CONFIG_WORD_2_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg reads and replaces this word; individual hardware fields remain unnamed.</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFO_CONFIG_WORD_3_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg reads and replaces this word; individual hardware fields remain unnamed.</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_NRX_RECOVERED_GAPS</name>
      <description>Sparse NRX words absent from the public platform PAC.</description>
      <baseAddress>0x20107800</baseAddress>
      <registers>
        <register>
          <name>FFT_SCALE_CONTROL_OPAQUE</name>
          <description>Complete phy_fft_scale_force read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BACKUP_WORD_0C_OPAQUE</name>
          <description>Complete phy_dig_reg_backup saves and restores this word; all field semantics remain unknown.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ONE_TONE_SPUR_CONTROL_OPAQUE</name>
          <description>Complete phy_spur_reg_write_one_tone reads and replaces this word on three control-flow paths; individual hardware fields remain unnamed.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FREQUENCY_CORRECTION_CONTROL_OPAQUE</name>
          <description>Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFO_HIGH_CONTROL_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg replaces bits 31:29 with the observed constant pattern while preserving bits 28:0; the hardware field meaning remains unknown.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HIGH_MODE_UNKNOWN</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_FILTER_CONTROL_OPAQUE</name>
          <description>Complete phy_chan_filt_set read-modify-writes this word and complete phy_dig_reg_backup saves/restores it.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
