ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_BB_RECOVERED_GAPS</name>
      <description>Sparse BB words absent from the public platform PAC.</description>
      <baseAddress>0x20107C00</baseAddress>
      <registers>
        <register>
          <name>SPUR_COEFFICIENT_CONTROL_0_OPAQUE</name>
          <description>Complete phy_spur_coef_cfg clears bit 13 through two read-modify-write paths; all hardware field names remain unknown.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BIT_13_CONTROL_UNKNOWN</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_COUNTER_CONTROL_OPAQUE</name>
          <description>Complete phy_set_cca_cnt read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CCA_COUNTER_STATUS_0_OPAQUE</name>
          <description>Complete phy_get_cca_cnt reads this word; hardware access semantics remain unknown.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCA_COUNTER_STATUS_1_OPAQUE</name>
          <description>Complete phy_get_cca_cnt reads this word; hardware access semantics remain unknown.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CFO_CONFIG_WORD_4_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg reads and replaces this word; individual hardware fields remain unnamed.</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFO_CONFIG_WORD_5_OPAQUE</name>
          <description>Complete phy_bb_cfo_cfg replaces this word and independently read-modify-writes bit 12; the hardware field meaning remains unknown.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BIT_12_CONTROL_UNKNOWN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_BRX_RECOVERED_GAPS</name>
      <description>Sparse BRX words absent from the public platform PAC.</description>
      <baseAddress>0x20108000</baseAddress>
      <registers>
        <register>
          <name>FREQUENCY_CORRECTION_CONTROL_OPAQUE</name>
          <description>Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IEEE802154_MAC</name>
      <description>Dedicated ESP32-S31 IEEE 802.15.4 MAC aperture at 0x20103000. This
        selective foundation publishes only register geometry exercised by
        the pinned public common/chip LL accessors. The public struct and
        register headers still carry TODO ZB-93 pending an authoritative
        regdesc CSV, so untouched DTM, timing, debug-selector and modem-sleep
        words remain deliberately absent and no reset values are claimed.</description>
      <baseAddress>0x20103000</baseAddress>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>Write-only IEEE 802.15.4 MAC command opcode. The public common LL constrains commands to the listed values.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPCODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>TX_START</name>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_START</name>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_TX_START</name>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_START</name>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_TX_START</name>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_RX_START</name>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_STOP</name>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_START</name>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_STOP</name>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_START</name>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_STOP</name>
                  <value>79</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL</name>
          <description>Selected MAC policy bits mutated by public common LL accessors. Unused control bits remain absent.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTO_ACK_TX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENHANCED_ACK_TX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTO_ACK_RX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COORDINATOR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROMISCUOUS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDING_ENHANCED</name>
              <description>Boolean pending-mode selector used by the current public LL. The wider public pending-mode enum is not encoded in this one-bit field.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTIPAN0_ENABLED</name>
              <description>Enable public multipan context zero.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTIPAN1_ENABLED</name>
              <description>Enable public multipan context one.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTIPAN2_ENABLED</name>
              <description>Enable public multipan context two.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTIPAN3_ENABLED</name>
              <description>Enable public multipan context three.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>MULTIPAN%s_SHORT_ADDRESS</name>
          <description>Sixteen-bit short address for one public multipan context.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>MULTIPAN%s_PAN_ID</name>
          <description>Sixteen-bit PAN identifier for one public multipan context.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAN_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>MULTIPAN%s_EXTENDED_ADDRESS_LOW</name>
          <description>Extended-address bytes zero through three packed little-endian by the public common LL.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS_WORD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>MULTIPAN%s_EXTENDED_ADDRESS_HIGH</name>
          <description>Extended-address bytes four through seven packed little-endian by the public common LL.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS_WORD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL</name>
          <description>Selected primary frequency code. Other multi-channel and frequency-hop controls declared by the struct are not used by the public common LL and remain absent.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FREQUENCY_CODE</name>
              <description>Eight-bit code read and written by ieee802154_ll_get_freq/set_freq; this register model does not equate it to an IEEE channel number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER</name>
          <description>Eight-bit transmit-power code written through a preserving bitfield update by the public common LL.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POWER_CODE</name>
              <description>Raw eight-bit hardware code; no dBm conversion is claimed at the register boundary.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ED_DURATION</name>
          <description>Energy-detection duration field written by the public common LL. The adjacent delay field is not used there and remains absent.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DURATION</name>
              <description>Twenty-four-bit physical field. The current public setter accepts only a uint16_t and therefore exercises a strict subset of its declared range.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ED_CONFIG</name>
          <description>Energy-detection and clear-channel-assessment configuration plus read-only result fields used by the public common LL. The pinned reg macros call bits 12:11 ED_SAMPLE_MODE and bit 13 DIS_ED_POWER_SEL, while the pinned struct/common LL operate them as ED_SAMPLE_RATE and ED_SAMPLE_MODE respectively; this model follows the operational struct/common-LL pair and leaves the naming conflict explicit.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCA_THRESHOLD_CODE</name>
              <description>Eight-bit code written from an int8_t; signed physical units are intentionally left to the HAL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ED_SAMPLE_RATE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>ONE_PER_US</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_PER_US</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_PER_US</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_PER_US</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ED_SAMPLE_MODE</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_MODE</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>CARRIER</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENERGY_DETECTION</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CARRIER_OR_ENERGY_DETECTION</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CARRIER_AND_ENERGY_DETECTION</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ED_RSS_CODE</name>
              <description>Eight-bit result returned as int8_t by the public common LL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA_BUSY</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACK_TIMEOUT</name>
          <description>Sixteen-bit acknowledgment timeout read and written by the public common LL. Units are not assigned by this register model.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_ENABLE</name>
          <description>Individual event enables mutated by the public common LL. Bits seven and thirteen remain physically observable but have no assigned vendor event semantics.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_DONE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_DONE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACK_TX_DONE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACK_RX_DONE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ABORT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_ABORT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ED_DONE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_7</name>
              <description>Physically present event-enable bit without an assigned public vendor event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_OVERFLOW</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1_OVERFLOW</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLOCK_COUNT_MATCH</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_SFD_DONE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SFD_DONE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_13</name>
              <description>Physically present event-enable bit without an assigned public vendor event.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
