ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
        <register>
          <name>EVENT_STATUS</name>
          <description>Individual event status bits read by the public LL. The target-reviewed overlay assigns the read-write W1C contract for the applicable ESP32-S31 revision; bits seven and thirteen have no assigned vendor event semantics.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TX_DONE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_DONE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACK_TX_DONE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACK_RX_DONE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ABORT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_ABORT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ED_DONE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_7</name>
              <description>Physically present event-status bit without an assigned public vendor event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_OVERFLOW</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1_OVERFLOW</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLOCK_COUNT_MATCH</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_SFD_DONE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_SFD_DONE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_13</name>
              <description>Physically present event-status bit without an assigned public vendor event.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ABORT_ENABLE</name>
          <description>Low thirty-one receive-abort enable bits mutated by public LL accessors. Only the finite abort-reason values named by the LL are semantically classified.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mask every receive-abort reason.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNTIME_BASELINE</name>
                  <description>Reviewed receive-abort baseline used by the runtime ISR.</description>
                  <value>163840</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_OPERATION_REASONS</name>
                  <description>Enable ED abort, ED stop, and ED coexistence rejection for one finite ED or CCA operation.</description>
                  <value>58720256</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PENDING_CONFIG</name>
          <description>Selected outgoing acknowledgment frame-pending bit. The untouched timeout field remains absent.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRAME_PENDING</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_PTI</name>
          <description>Selected coexistence priority fields. The public disable-coexistence helper writes value three to each through two preserving field updates. Other antenna and RF controls remain absent.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXRX_PTI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACK_PTI</name>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ABORT_ENABLE</name>
          <description>Low thirty-one transmit-abort enable bits mutated by public LL accessors. Only the finite abort-reason values named by the LL are semantically classified.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mask every transmit-abort reason.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNTIME_BASELINE</name>
                  <description>Reviewed transmit-abort baseline used by the runtime ISR.</description>
                  <value>25591808</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENHANCED_ACK_NOTIFY</name>
          <description>Write-only enhanced-ack generation-done notification word. The public common LL writes the complete value one; trigger/clear behavior is not inferred.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NOTIFY_IMAGE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_STATUS</name>
          <description>Receive status snapshot returned whole by the public common LL; selected subfields are independently named by the struct and accessor set.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FILTER_FAIL_REASON</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ABORT_REASON</name>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>RX_STOP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFD_TIMEOUT</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_ERROR</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_LENGTH</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_FAIL</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_RSS</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BREAK</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNEXPECTED_ACK</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_RESTART</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ACK_TIMEOUT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ACK_STOP</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ACK_COEX_BREAK</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENHANCED_ACK_SECURITY_ERROR</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_ABORT</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_STOP</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_COEX_REJECT</name>
                  <value>26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>Three-bit receive state. The public LL only establishes that value one is RECEIVE_SFD and tests for later states with a greater-than comparison.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CURRENT_CHANNEL_INDEX</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PREAMBLE_MATCH</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFD_MATCH</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_STATUS</name>
          <description>Transmit status snapshot returned whole by the public common LL; abort and security-error subfields have public finite reason enums.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ABORT_REASON</name>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>RX_ACK_STOP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_SFD_TIMEOUT</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_CRC_ERROR</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_INVALID_LENGTH</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_FILTER_FAIL</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_NO_RSS</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_COEX_BREAK</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_TYPE_NOT_ACK</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_RESTART</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACK_TIMEOUT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_STOP</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_COEX_BREAK</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_SECURITY_ERROR</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_FAILED</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_BUSY</name>
                  <value>25</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECURITY_ERROR</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>FRAME_CONTROL_NOT_SET</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_SECURITY_LEVEL</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_PARSE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_COUNTER_SUPPRESSION</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_THRESHOLD</name>
          <description>Complete timer-zero threshold word written by the public common LL.</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0_VALUE</name>
          <description>Complete timer-zero value word read by the public common LL.</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER1_THRESHOLD</name>
          <description>Complete timer-one threshold word written by the public common LL.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER1_VALUE</name>
          <description>Complete timer-one value word read by the public common LL.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_DMA_ADDRESS</name>
          <description>Complete transmit frame-buffer address written by the public common LL. Address validity and buffer lifetime remain HAL responsibilities.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DMA_ADDRESS</name>
          <description>Complete receive frame-buffer address written by the public common LL. Address validity and buffer lifetime remain HAL responsibilities.</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXON_DELAY</name>
          <description>Receive-on delay image updated by the pinned public ESP32-S31 IEEE 802.15.4 initializer. The literal value 50 is reviewed; physical units remain outside the PAC.</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXON_DELAY</name>
              <description>Eleven-bit preserving field written with literal 50 after the shared BTBB transmit-on delay override.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURITY_CONTROL</name>
          <description>Transmit-security enable and payload-offset fields used by the public common LL.</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAYLOAD_OFFSET</name>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURITY_ADDRESS_LOW</name>
          <description>Security extended-address bytes zero through three packed little-endian by the public common LL.</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS_WORD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURITY_ADDRESS_HIGH</name>
          <description>Security extended-address bytes four through seven packed little-endian by the public common LL.</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS_WORD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
