ermacv/open-esp-radio-rs/registers/esp32s31/published/radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IEEE802154_INTERRUPT_ROUTE</name>
      <description>The two CPU interrupt-matrix words for ESP32-S31 modem source 132
(MODEM_ZB_MAC). This source-specific view is retained with the IEEE 802.15.4
owner and publishes only the generated field readers needed to prove that a
polled or validation transaction starts with both CPU routes detached.</description>
      <baseAddress>0x20585210</baseAddress>
      <registers>
        <register>
          <name>CORE0_ROUTE</name>
          <description>Core-zero destination and privilege routing for MODEM_ZB_MAC.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAP</name>
              <description>CPU-interrupt destination selected for the peripheral source.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_6_7</name>
              <description>Unassigned bits retained solely so reset-state observation cannot erase an unexpected nonzero value.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PASS_LEVEL</name>
              <description>Privilege pass/remap level selected for the peripheral source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_10_31</name>
              <description>Unassigned bits retained solely so reset-state observation cannot erase an unexpected nonzero value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE1_ROUTE</name>
          <description>Core-one destination and privilege routing for MODEM_ZB_MAC.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAP</name>
              <description>CPU-interrupt destination selected for the peripheral source.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_6_7</name>
              <description>Unassigned bits retained solely so reset-state observation cannot erase an unexpected nonzero value.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PASS_LEVEL</name>
              <description>Privilege pass/remap level selected for the peripheral source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UNCLASSIFIED_10_31</name>
              <description>Unassigned bits retained solely so reset-state observation cannot erase an unexpected nonzero value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MODEM_ETM</name>
      <description>ESP32-S31 modem event-task matrix at MODEM_BASE + 0x8800, shared by the
IEEE 802.15.4 and Bluetooth lifecycles. The public IEEE 802.15.4 driver names
the channel-enable, set and clear words and the per-channel event/task pair
at an eight-byte stride, and programs channels zero and one; the BTDM runtime
programs channels four through seven through the same words. Channel bits and
identifiers without a reviewed user remain absent and no reset values are
claimed.</description>
      <baseAddress>0x20108800</baseAddress>
      <registers>
        <register>
          <name>CHANNEL_ENABLE</name>
          <description>Channel-enable status word. The IEEE 802.15.4 driver reads it to decide whether a channel must be disabled; the BTDM runtime reads the complete word.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Channel 4 is enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Channel 5 is enabled.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Channel 6 is enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Channel 7 is enabled.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_ENABLE_SET</name>
          <description>Channel-enable set word. Its fields are write-trigger: writing 1 enables that channel and writing 0 has no effect, as in the ESP32-S31 SoC ETM of identical layout. This semantics is not yet verified on the modem ETM hardware. The IEEE 802.15.4 driver writes the word back after reading it with the selected channel bit added; the BTDM runtime writes complete channel images.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Writing 1 enables channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Writing 1 enables channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Writing 1 enables channel 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Writing 1 enables channel 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Writing 1 enables channel 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Writing 1 enables channel 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_ENABLE_CLEAR</name>
          <description>Channel-enable clear word. Its fields are write-trigger: writing 1 disables that channel and writing 0 has no effect, as in the ESP32-S31 SoC ETM of identical layout. This semantics is not yet verified on the modem ETM hardware. The IEEE 802.15.4 driver writes the word back after reading it with the selected channel bit added; the BTDM runtime writes complete single-channel images.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Writing 1 disables channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Writing 1 disables channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Writing 1 disables channel 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Writing 1 disables channel 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Writing 1 disables channel 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Writing 1 disables channel 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH%s_EVENT</name>
          <description>Complete event identifier monitored by the selected channel.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>Event identifier written as a complete word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>IEEE802154_TIMER1_OVERFLOW</name>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IEEE802154_TIMER0_OVERFLOW</name>
                  <value>80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH%s_TASK</name>
          <description>Complete task identifier triggered when the selected channel's event occurs.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>Task identifier written as a complete word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>IEEE802154_ED_TRIG_TX</name>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IEEE802154_RX_START</name>
                  <value>85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IEEE802154_TX_START</name>
                  <value>88</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
